{
  "log": {
    "level": "debug",
    "timestamp": true
  },
  "dns": {
    "servers": [
      {
        "tag": "proxyDns",
        "address": "8.8.8.8",
        "detour": "proxy"
      },
      {
        "tag": "localDns",
        "address": "https://223.5.5.5/dns-query",
        "detour": "direct"
      },
      {
        "tag": "block",
        "address": "rcode://success"
      },
      {
        "tag": "remote",
        "address": "fakeip"
      }
    ],
    "rules": [
      {
        "domain": [
          "ghproxy.com",
          "cdn.jsdelivr.net"
        ],
        "server": "localDns"
      },
      {
        "geosite": "category-ads-all",
        "server": "block"
      },
      {
        "outbound": "any",
        "server": "localDns",
        "disable_cache": true
      },
      {
        "geosite": [
          "private",
          "cn"
        ],
        "server": "localDns"
      },
      {
        "clash_mode": "direct",
        "server": "localDns"
      },
      {
        "clash_mode": "global",
        "server": "proxyDns"
      },
      {
        "geosite": "geolocation-!cn",
        "server": "proxyDns"
      },
      {
        "query_type": [
          "A",
          "AAAA"
        ],
        "server": "remote"
      }
    ],
    "final": "localDns",
    "fakeip": {
      "enabled": true,
      "inet4_range": "198.18.0.0/15",
      "inet6_range": "fc00::/18"
    },
    "independent_cache": true,
    "strategy": "ipv4_only"
  },
  "inbounds": [
    {
      "type": "tun",
      "inet4_address": "172.19.0.1/30",
      "mtu": 9000,
      "auto_route": true,
      "strict_route": true,
      "sniff": true,
      "endpoint_independent_nat": false,
      "stack": "system",
      "platform": {
        "http_proxy": {
          "enabled": true,
          "server": "127.0.0.1",
          "server_port": 2080
        }
      }
    },
    {
      "type": "mixed",
      "listen": "127.0.0.1",
      "listen_port": 2080,
      "sniff": true,
      "users": []
    }
  ],
  "outbounds": [
    {
      "tag": "proxy",
      "type": "selector",
      "outbounds": [
        "🧩auto",
        "hk tuic",
        "tuicv5",
        "tw",
        "tw h2",
        "hk",
        "🇩🇪 DE",
        "hk1",
        "tw 1",
        "hk 2",
        "ssv2ray",
        "ss",
        "test",
        "auto",
        "自动最优线路(新协议)-网址: dg1.top",
        "🇭🇰 1香港集群-全网优化(新协议)",
        "🇭🇰 1香港集群-全网优化(vmess)",
        "🇭🇰 2香港-专线(iOS优化)",
        "🇹🇼 5台湾-联通/移动(新协议)",
        "🇯🇵 6日本-东部优化(新协议)",
        "🇯🇵 7日本-联通/移动(新协议)",
        "🇰🇷 8韩国集群-全网优化(新协议)",
        "🇰🇷 8韩国集群-全网优化(vmess)",
        "🇰🇷 9韩国-全网优化(新协议)",
        "🇰🇷 9韩国-专线(iOS优化)",
        "🇯🇵 10日本(新协议)-全网优化",
        "🇯🇵 10日本-专线(iOS优化)",
        "🇺🇸 11美国-全网优化(新协议)",
        "🇺🇸 11美国-全网优化(iOS优化)",
        "🇺🇸 12美国凤凰城-ChatGPT(新协议)",
        "🇺🇸 12美国凤凰城-ChatGPT(vmess)",
        "🇦🇪 13迪拜-电信/移动/南方联通(新协议)",
        "🇮🇳 14印度-移动/南方联通(新协议)",
        "🇸🇬 15新加坡-全网优化(新协议)",
        "🇸🇬 15新加坡-专线(iOS优化)",
        "🇸🇬 24新加坡-联通/移动(新协议)",
        "🇩🇪 16德国-电信/联通(新协议)",
        "🇬🇧 17英国-ChatGPT(新协议)",
        "🇨🇦 18加拿大-ChatGPT(新协议)",
        "🇦🇺 19悉尼-ChatGPT(新协议)",
        "🇧🇷 20巴西-ChatGPT(新协议)",
        "🇨🇱 21智利-ChatGPT(新协议)",
        "🇹🇷 22土耳其-电信/联通(新协议)",
        "🇫🇷 23法国-全网优化(新协议)",
        "🇭🇰 HK WSS",
        "🇹🇼 TW wss",
        "🇹🇼 TW tr",
        "🇹🇼 TW 1tr",
        "hk re",
        "🇺🇸 US tr",
        "🇬🇧 UK",
        "🇬🇪 GE wss",
        "tw h22",
        "🇭🇰 HK vmg",
        "tw vlt",
        "🇺🇸 US vmg",
        "🇬🇪 GE vmg",
        "🇬🇧 UK vmg",
        "🇭🇰 HK 1WSS",
        "🇹🇼 TW 1WSS",
        "🇺🇸 US WSS",
        "🇭🇰 HK 1TR",
        "tw vmg",
        "tw ws",
        "tw vlg",
        "tw re",
        "tw1 re",
        "CC1-01",
        "CC1-02",
        "CC1-03",
        "CC2-server ws1",
        "CC2-server ws2",
        "🇺🇸 US-WS1-1",
        "🇺🇸 US-WS1-2"
      ]
    },
    {
      "tag": "🌏 final",
      "type": "selector",
      "outbounds": [
        "🧩auto",
        "hk tuic",
        "tuicv5",
        "tw",
        "tw h2",
        "hk",
        "🇩🇪 DE",
        "hk1",
        "tw 1",
        "hk 2",
        "ssv2ray",
        "ss",
        "test",
        "auto",
        "自动最优线路(新协议)-网址: dg1.top",
        "🇭🇰 1香港集群-全网优化(新协议)",
        "🇭🇰 1香港集群-全网优化(vmess)",
        "🇭🇰 2香港-专线(iOS优化)",
        "🇹🇼 5台湾-联通/移动(新协议)",
        "🇯🇵 6日本-东部优化(新协议)",
        "🇯🇵 7日本-联通/移动(新协议)",
        "🇰🇷 8韩国集群-全网优化(新协议)",
        "🇰🇷 8韩国集群-全网优化(vmess)",
        "🇰🇷 9韩国-全网优化(新协议)",
        "🇰🇷 9韩国-专线(iOS优化)",
        "🇯🇵 10日本(新协议)-全网优化",
        "🇯🇵 10日本-专线(iOS优化)",
        "🇺🇸 11美国-全网优化(新协议)",
        "🇺🇸 11美国-全网优化(iOS优化)",
        "🇺🇸 12美国凤凰城-ChatGPT(新协议)",
        "🇺🇸 12美国凤凰城-ChatGPT(vmess)",
        "🇦🇪 13迪拜-电信/移动/南方联通(新协议)",
        "🇮🇳 14印度-移动/南方联通(新协议)",
        "🇸🇬 15新加坡-全网优化(新协议)",
        "🇸🇬 15新加坡-专线(iOS优化)",
        "🇸🇬 24新加坡-联通/移动(新协议)",
        "🇩🇪 16德国-电信/联通(新协议)",
        "🇬🇧 17英国-ChatGPT(新协议)",
        "🇨🇦 18加拿大-ChatGPT(新协议)",
        "🇦🇺 19悉尼-ChatGPT(新协议)",
        "🇧🇷 20巴西-ChatGPT(新协议)",
        "🇨🇱 21智利-ChatGPT(新协议)",
        "🇹🇷 22土耳其-电信/联通(新协议)",
        "🇫🇷 23法国-全网优化(新协议)",
        "🇭🇰 HK WSS",
        "🇹🇼 TW wss",
        "🇹🇼 TW tr",
        "🇹🇼 TW 1tr",
        "hk re",
        "🇺🇸 US tr",
        "🇬🇧 UK",
        "🇬🇪 GE wss",
        "tw h22",
        "🇭🇰 HK vmg",
        "tw vlt",
        "🇺🇸 US vmg",
        "🇬🇪 GE vmg",
        "🇬🇧 UK vmg",
        "🇭🇰 HK 1WSS",
        "🇹🇼 TW 1WSS",
        "🇺🇸 US WSS",
        "🇭🇰 HK 1TR",
        "tw vmg",
        "tw ws",
        "tw vlg",
        "tw re",
        "tw1 re",
        "CC1-01",
        "CC1-02",
        "CC1-03",
        "CC2-server ws1",
        "CC2-server ws2",
        "🇺🇸 US-WS1-1",
        "🇺🇸 US-WS1-2",
        "direct"
      ]
    },
    {
      "tag": "🤖 gr",
      "type": "selector",
      "outbounds": [
        "🧩auto",
        "hk tuic",
        "tuicv5",
        "tw",
        "tw h2",
        "hk",
        "🇩🇪 DE",
        "hk1",
        "tw 1",
        "hk 2",
        "ssv2ray",
        "ss",
        "test",
        "auto",
        "自动最优线路(新协议)-网址: dg1.top",
        "🇭🇰 1香港集群-全网优化(新协议)",
        "🇭🇰 1香港集群-全网优化(vmess)",
        "🇭🇰 2香港-专线(iOS优化)",
        "🇹🇼 5台湾-联通/移动(新协议)",
        "🇯🇵 6日本-东部优化(新协议)",
        "🇯🇵 7日本-联通/移动(新协议)",
        "🇰🇷 8韩国集群-全网优化(新协议)",
        "🇰🇷 8韩国集群-全网优化(vmess)",
        "🇰🇷 9韩国-全网优化(新协议)",
        "🇰🇷 9韩国-专线(iOS优化)",
        "🇯🇵 10日本(新协议)-全网优化",
        "🇯🇵 10日本-专线(iOS优化)",
        "🇺🇸 11美国-全网优化(新协议)",
        "🇺🇸 11美国-全网优化(iOS优化)",
        "🇺🇸 12美国凤凰城-ChatGPT(新协议)",
        "🇺🇸 12美国凤凰城-ChatGPT(vmess)",
        "🇦🇪 13迪拜-电信/移动/南方联通(新协议)",
        "🇮🇳 14印度-移动/南方联通(新协议)",
        "🇸🇬 15新加坡-全网优化(新协议)",
        "🇸🇬 15新加坡-专线(iOS优化)",
        "🇸🇬 24新加坡-联通/移动(新协议)",
        "🇩🇪 16德国-电信/联通(新协议)",
        "🇬🇧 17英国-ChatGPT(新协议)",
        "🇨🇦 18加拿大-ChatGPT(新协议)",
        "🇦🇺 19悉尼-ChatGPT(新协议)",
        "🇧🇷 20巴西-ChatGPT(新协议)",
        "🇨🇱 21智利-ChatGPT(新协议)",
        "🇹🇷 22土耳其-电信/联通(新协议)",
        "🇫🇷 23法国-全网优化(新协议)",
        "🇭🇰 HK WSS",
        "🇹🇼 TW wss",
        "🇹🇼 TW tr",
        "🇹🇼 TW 1tr",
        "hk re",
        "🇺🇸 US tr",
        "🇬🇧 UK",
        "🇬🇪 GE wss",
        "tw h22",
        "🇭🇰 HK vmg",
        "tw vlt",
        "🇺🇸 US vmg",
        "🇬🇪 GE vmg",
        "🇬🇧 UK vmg",
        "🇭🇰 HK 1WSS",
        "🇹🇼 TW 1WSS",
        "🇺🇸 US WSS",
        "🇭🇰 HK 1TR",
        "tw vmg",
        "tw ws",
        "tw vlg",
        "tw re",
        "tw1 re",
        "CC1-01",
        "CC1-02",
        "CC1-03",
        "CC2-server ws1",
        "CC2-server ws2",
        "🇺🇸 US-WS1-1",
        "🇺🇸 US-WS1-2",
        "direct"
      ]
    },
    {
      "tag": "🤖 gn",
      "type": "selector",
      "outbounds": [
        "🧩auto",
        "hk tuic",
        "tuicv5",
        "tw",
        "tw h2",
        "hk",
        "🇩🇪 DE",
        "hk1",
        "tw 1",
        "hk 2",
        "ssv2ray",
        "ss",
        "test",
        "auto",
        "自动最优线路(新协议)-网址: dg1.top",
        "🇭🇰 1香港集群-全网优化(新协议)",
        "🇭🇰 1香港集群-全网优化(vmess)",
        "🇭🇰 2香港-专线(iOS优化)",
        "🇹🇼 5台湾-联通/移动(新协议)",
        "🇯🇵 6日本-东部优化(新协议)",
        "🇯🇵 7日本-联通/移动(新协议)",
        "🇰🇷 8韩国集群-全网优化(新协议)",
        "🇰🇷 8韩国集群-全网优化(vmess)",
        "🇰🇷 9韩国-全网优化(新协议)",
        "🇰🇷 9韩国-专线(iOS优化)",
        "🇯🇵 10日本(新协议)-全网优化",
        "🇯🇵 10日本-专线(iOS优化)",
        "🇺🇸 11美国-全网优化(新协议)",
        "🇺🇸 11美国-全网优化(iOS优化)",
        "🇺🇸 12美国凤凰城-ChatGPT(新协议)",
        "🇺🇸 12美国凤凰城-ChatGPT(vmess)",
        "🇦🇪 13迪拜-电信/移动/南方联通(新协议)",
        "🇮🇳 14印度-移动/南方联通(新协议)",
        "🇸🇬 15新加坡-全网优化(新协议)",
        "🇸🇬 15新加坡-专线(iOS优化)",
        "🇸🇬 24新加坡-联通/移动(新协议)",
        "🇩🇪 16德国-电信/联通(新协议)",
        "🇬🇧 17英国-ChatGPT(新协议)",
        "🇨🇦 18加拿大-ChatGPT(新协议)",
        "🇦🇺 19悉尼-ChatGPT(新协议)",
        "🇧🇷 20巴西-ChatGPT(新协议)",
        "🇨🇱 21智利-ChatGPT(新协议)",
        "🇹🇷 22土耳其-电信/联通(新协议)",
        "🇫🇷 23法国-全网优化(新协议)",
        "🇭🇰 HK WSS",
        "🇹🇼 TW wss",
        "🇹🇼 TW tr",
        "🇹🇼 TW 1tr",
        "hk re",
        "🇺🇸 US tr",
        "🇬🇧 UK",
        "🇬🇪 GE wss",
        "tw h22",
        "🇭🇰 HK vmg",
        "tw vlt",
        "🇺🇸 US vmg",
        "🇬🇪 GE vmg",
        "🇬🇧 UK vmg",
        "🇭🇰 HK 1WSS",
        "🇹🇼 TW 1WSS",
        "🇺🇸 US WSS",
        "🇭🇰 HK 1TR",
        "tw vmg",
        "tw ws",
        "tw vlg",
        "tw re",
        "tw1 re",
        "CC1-01",
        "CC1-02",
        "CC1-03",
        "CC2-server ws1",
        "CC2-server ws2",
        "🇺🇸 US-WS1-1",
        "🇺🇸 US-WS1-2",
        "direct"
      ]
    },
    {
      "tag": "🤖 hi",
      "type": "selector",
      "outbounds": [
        "🧩auto",
        "hk tuic",
        "tuicv5",
        "tw",
        "tw h2",
        "hk",
        "🇩🇪 DE",
        "hk1",
        "tw 1",
        "hk 2",
        "ssv2ray",
        "ss",
        "test",
        "auto",
        "自动最优线路(新协议)-网址: dg1.top",
        "🇭🇰 1香港集群-全网优化(新协议)",
        "🇭🇰 1香港集群-全网优化(vmess)",
        "🇭🇰 2香港-专线(iOS优化)",
        "🇹🇼 5台湾-联通/移动(新协议)",
        "🇯🇵 6日本-东部优化(新协议)",
        "🇯🇵 7日本-联通/移动(新协议)",
        "🇰🇷 8韩国集群-全网优化(新协议)",
        "🇰🇷 8韩国集群-全网优化(vmess)",
        "🇰🇷 9韩国-全网优化(新协议)",
        "🇰🇷 9韩国-专线(iOS优化)",
        "🇯🇵 10日本(新协议)-全网优化",
        "🇯🇵 10日本-专线(iOS优化)",
        "🇺🇸 11美国-全网优化(新协议)",
        "🇺🇸 11美国-全网优化(iOS优化)",
        "🇺🇸 12美国凤凰城-ChatGPT(新协议)",
        "🇺🇸 12美国凤凰城-ChatGPT(vmess)",
        "🇦🇪 13迪拜-电信/移动/南方联通(新协议)",
        "🇮🇳 14印度-移动/南方联通(新协议)",
        "🇸🇬 15新加坡-全网优化(新协议)",
        "🇸🇬 15新加坡-专线(iOS优化)",
        "🇸🇬 24新加坡-联通/移动(新协议)",
        "🇩🇪 16德国-电信/联通(新协议)",
        "🇬🇧 17英国-ChatGPT(新协议)",
        "🇨🇦 18加拿大-ChatGPT(新协议)",
        "🇦🇺 19悉尼-ChatGPT(新协议)",
        "🇧🇷 20巴西-ChatGPT(新协议)",
        "🇨🇱 21智利-ChatGPT(新协议)",
        "🇹🇷 22土耳其-电信/联通(新协议)",
        "🇫🇷 23法国-全网优化(新协议)",
        "🇭🇰 HK WSS",
        "🇹🇼 TW wss",
        "🇹🇼 TW tr",
        "🇹🇼 TW 1tr",
        "hk re",
        "🇺🇸 US tr",
        "🇬🇧 UK",
        "🇬🇪 GE wss",
        "tw h22",
        "🇭🇰 HK vmg",
        "tw vlt",
        "🇺🇸 US vmg",
        "🇬🇪 GE vmg",
        "🇬🇧 UK vmg",
        "🇭🇰 HK 1WSS",
        "🇹🇼 TW 1WSS",
        "🇺🇸 US WSS",
        "🇭🇰 HK 1TR",
        "tw vmg",
        "tw ws",
        "tw vlg",
        "tw re",
        "tw1 re",
        "CC1-01",
        "CC1-02",
        "CC1-03",
        "CC2-server ws1",
        "CC2-server ws2",
        "🇺🇸 US-WS1-1",
        "🇺🇸 US-WS1-2",
        "direct"
      ]
    },
    {
      "tag": "🌌 yt",
      "type": "selector",
      "outbounds": [
        "🎬 HK",
        "🎬 TW",
        "🎬 SG",
        "📺 JP",
        "📺 US",
        "📺 KR",
        "🧩auto",
        "hk tuic",
        "tuicv5",
        "tw",
        "tw h2",
        "hk",
        "🇩🇪 DE",
        "hk1",
        "tw 1",
        "hk 2",
        "ssv2ray",
        "ss",
        "test",
        "auto",
        "自动最优线路(新协议)-网址: dg1.top",
        "🇭🇰 1香港集群-全网优化(新协议)",
        "🇭🇰 1香港集群-全网优化(vmess)",
        "🇭🇰 2香港-专线(iOS优化)",
        "🇹🇼 5台湾-联通/移动(新协议)",
        "🇯🇵 6日本-东部优化(新协议)",
        "🇯🇵 7日本-联通/移动(新协议)",
        "🇰🇷 8韩国集群-全网优化(新协议)",
        "🇰🇷 8韩国集群-全网优化(vmess)",
        "🇰🇷 9韩国-全网优化(新协议)",
        "🇰🇷 9韩国-专线(iOS优化)",
        "🇯🇵 10日本(新协议)-全网优化",
        "🇯🇵 10日本-专线(iOS优化)",
        "🇺🇸 11美国-全网优化(新协议)",
        "🇺🇸 11美国-全网优化(iOS优化)",
        "🇺🇸 12美国凤凰城-ChatGPT(新协议)",
        "🇺🇸 12美国凤凰城-ChatGPT(vmess)",
        "🇦🇪 13迪拜-电信/移动/南方联通(新协议)",
        "🇮🇳 14印度-移动/南方联通(新协议)",
        "🇸🇬 15新加坡-全网优化(新协议)",
        "🇸🇬 15新加坡-专线(iOS优化)",
        "🇸🇬 24新加坡-联通/移动(新协议)",
        "🇩🇪 16德国-电信/联通(新协议)",
        "🇬🇧 17英国-ChatGPT(新协议)",
        "🇨🇦 18加拿大-ChatGPT(新协议)",
        "🇦🇺 19悉尼-ChatGPT(新协议)",
        "🇧🇷 20巴西-ChatGPT(新协议)",
        "🇨🇱 21智利-ChatGPT(新协议)",
        "🇹🇷 22土耳其-电信/联通(新协议)",
        "🇫🇷 23法国-全网优化(新协议)",
        "🇭🇰 HK WSS",
        "🇹🇼 TW wss",
        "🇹🇼 TW tr",
        "🇹🇼 TW 1tr",
        "hk re",
        "🇺🇸 US tr",
        "🇬🇧 UK",
        "🇬🇪 GE wss",
        "tw h22",
        "🇭🇰 HK vmg",
        "tw vlt",
        "🇺🇸 US vmg",
        "🇬🇪 GE vmg",
        "🇬🇧 UK vmg",
        "🇭🇰 HK 1WSS",
        "🇹🇼 TW 1WSS",
        "🇺🇸 US WSS",
        "🇭🇰 HK 1TR",
        "tw vmg",
        "tw ws",
        "tw vlg",
        "tw re",
        "tw1 re",
        "CC1-01",
        "CC1-02",
        "CC1-03",
        "CC2-server ws1",
        "CC2-server ws2",
        "🇺🇸 US-WS1-1",
        "🇺🇸 US-WS1-2",
        "direct"
      ]
    },
    {
      "tag": "🌌 ytm",
      "type": "selector",
      "outbounds": [
        "🎬 HK",
        "🎬 TW",
        "🎬 SG",
        "📺 JP",
        "📺 US",
        "📺 KR",
        "🧩auto",
        "hk tuic",
        "tuicv5",
        "tw",
        "tw h2",
        "hk",
        "🇩🇪 DE",
        "hk1",
        "tw 1",
        "hk 2",
        "ssv2ray",
        "ss",
        "test",
        "auto",
        "自动最优线路(新协议)-网址: dg1.top",
        "🇭🇰 1香港集群-全网优化(新协议)",
        "🇭🇰 1香港集群-全网优化(vmess)",
        "🇭🇰 2香港-专线(iOS优化)",
        "🇹🇼 5台湾-联通/移动(新协议)",
        "🇯🇵 6日本-东部优化(新协议)",
        "🇯🇵 7日本-联通/移动(新协议)",
        "🇰🇷 8韩国集群-全网优化(新协议)",
        "🇰🇷 8韩国集群-全网优化(vmess)",
        "🇰🇷 9韩国-全网优化(新协议)",
        "🇰🇷 9韩国-专线(iOS优化)",
        "🇯🇵 10日本(新协议)-全网优化",
        "🇯🇵 10日本-专线(iOS优化)",
        "🇺🇸 11美国-全网优化(新协议)",
        "🇺🇸 11美国-全网优化(iOS优化)",
        "🇺🇸 12美国凤凰城-ChatGPT(新协议)",
        "🇺🇸 12美国凤凰城-ChatGPT(vmess)",
        "🇦🇪 13迪拜-电信/移动/南方联通(新协议)",
        "🇮🇳 14印度-移动/南方联通(新协议)",
        "🇸🇬 15新加坡-全网优化(新协议)",
        "🇸🇬 15新加坡-专线(iOS优化)",
        "🇸🇬 24新加坡-联通/移动(新协议)",
        "🇩🇪 16德国-电信/联通(新协议)",
        "🇬🇧 17英国-ChatGPT(新协议)",
        "🇨🇦 18加拿大-ChatGPT(新协议)",
        "🇦🇺 19悉尼-ChatGPT(新协议)",
        "🇧🇷 20巴西-ChatGPT(新协议)",
        "🇨🇱 21智利-ChatGPT(新协议)",
        "🇹🇷 22土耳其-电信/联通(新协议)",
        "🇫🇷 23法国-全网优化(新协议)",
        "🇭🇰 HK WSS",
        "🇹🇼 TW wss",
        "🇹🇼 TW tr",
        "🇹🇼 TW 1tr",
        "hk re",
        "🇺🇸 US tr",
        "🇬🇧 UK",
        "🇬🇪 GE wss",
        "tw h22",
        "🇭🇰 HK vmg",
        "tw vlt",
        "🇺🇸 US vmg",
        "🇬🇪 GE vmg",
        "🇬🇧 UK vmg",
        "🇭🇰 HK 1WSS",
        "🇹🇼 TW 1WSS",
        "🇺🇸 US WSS",
        "🇭🇰 HK 1TR",
        "tw vmg",
        "tw ws",
        "tw vlg",
        "tw re",
        "tw1 re",
        "CC1-01",
        "CC1-02",
        "CC1-03",
        "CC2-server ws1",
        "CC2-server ws2",
        "🇺🇸 US-WS1-1",
        "🇺🇸 US-WS1-2",
        "direct"
      ]
    },
    {
      "tag": "🛍️ spo",
      "type": "selector",
      "outbounds": [
        "🎬 HK",
        "🎬 TW",
        "🎬 SG",
        "📺 JP",
        "📺 US",
        "📺 KR",
        "🧩auto",
        "hk tuic",
        "tuicv5",
        "tw",
        "tw h2",
        "hk",
        "🇩🇪 DE",
        "hk1",
        "tw 1",
        "hk 2",
        "ssv2ray",
        "ss",
        "test",
        "auto",
        "自动最优线路(新协议)-网址: dg1.top",
        "🇭🇰 1香港集群-全网优化(新协议)",
        "🇭🇰 1香港集群-全网优化(vmess)",
        "🇭🇰 2香港-专线(iOS优化)",
        "🇹🇼 5台湾-联通/移动(新协议)",
        "🇯🇵 6日本-东部优化(新协议)",
        "🇯🇵 7日本-联通/移动(新协议)",
        "🇰🇷 8韩国集群-全网优化(新协议)",
        "🇰🇷 8韩国集群-全网优化(vmess)",
        "🇰🇷 9韩国-全网优化(新协议)",
        "🇰🇷 9韩国-专线(iOS优化)",
        "🇯🇵 10日本(新协议)-全网优化",
        "🇯🇵 10日本-专线(iOS优化)",
        "🇺🇸 11美国-全网优化(新协议)",
        "🇺🇸 11美国-全网优化(iOS优化)",
        "🇺🇸 12美国凤凰城-ChatGPT(新协议)",
        "🇺🇸 12美国凤凰城-ChatGPT(vmess)",
        "🇦🇪 13迪拜-电信/移动/南方联通(新协议)",
        "🇮🇳 14印度-移动/南方联通(新协议)",
        "🇸🇬 15新加坡-全网优化(新协议)",
        "🇸🇬 15新加坡-专线(iOS优化)",
        "🇸🇬 24新加坡-联通/移动(新协议)",
        "🇩🇪 16德国-电信/联通(新协议)",
        "🇬🇧 17英国-ChatGPT(新协议)",
        "🇨🇦 18加拿大-ChatGPT(新协议)",
        "🇦🇺 19悉尼-ChatGPT(新协议)",
        "🇧🇷 20巴西-ChatGPT(新协议)",
        "🇨🇱 21智利-ChatGPT(新协议)",
        "🇹🇷 22土耳其-电信/联通(新协议)",
        "🇫🇷 23法国-全网优化(新协议)",
        "🇭🇰 HK WSS",
        "🇹🇼 TW wss",
        "🇹🇼 TW tr",
        "🇹🇼 TW 1tr",
        "hk re",
        "🇺🇸 US tr",
        "🇬🇧 UK",
        "🇬🇪 GE wss",
        "tw h22",
        "🇭🇰 HK vmg",
        "tw vlt",
        "🇺🇸 US vmg",
        "🇬🇪 GE vmg",
        "🇬🇧 UK vmg",
        "🇭🇰 HK 1WSS",
        "🇹🇼 TW 1WSS",
        "🇺🇸 US WSS",
        "🇭🇰 HK 1TR",
        "tw vmg",
        "tw ws",
        "tw vlg",
        "tw re",
        "tw1 re",
        "CC1-01",
        "CC1-02",
        "CC1-03",
        "CC2-server ws1",
        "CC2-server ws2",
        "🇺🇸 US-WS1-1",
        "🇺🇸 US-WS1-2",
        "direct"
      ]
    },
    {
      "tag": "🤖 OpenAI",
      "type": "selector",
      "outbounds": [
        "🧩auto",
        "hk tuic",
        "tuicv5",
        "tw",
        "tw h2",
        "hk",
        "🇩🇪 DE",
        "hk1",
        "tw 1",
        "hk 2",
        "ssv2ray",
        "ss",
        "test",
        "auto",
        "自动最优线路(新协议)-网址: dg1.top",
        "🇭🇰 1香港集群-全网优化(新协议)",
        "🇭🇰 1香港集群-全网优化(vmess)",
        "🇭🇰 2香港-专线(iOS优化)",
        "🇹🇼 5台湾-联通/移动(新协议)",
        "🇯🇵 6日本-东部优化(新协议)",
        "🇯🇵 7日本-联通/移动(新协议)",
        "🇰🇷 8韩国集群-全网优化(新协议)",
        "🇰🇷 8韩国集群-全网优化(vmess)",
        "🇰🇷 9韩国-全网优化(新协议)",
        "🇰🇷 9韩国-专线(iOS优化)",
        "🇯🇵 10日本(新协议)-全网优化",
        "🇯🇵 10日本-专线(iOS优化)",
        "🇺🇸 11美国-全网优化(新协议)",
        "🇺🇸 11美国-全网优化(iOS优化)",
        "🇺🇸 12美国凤凰城-ChatGPT(新协议)",
        "🇺🇸 12美国凤凰城-ChatGPT(vmess)",
        "🇦🇪 13迪拜-电信/移动/南方联通(新协议)",
        "🇮🇳 14印度-移动/南方联通(新协议)",
        "🇸🇬 15新加坡-全网优化(新协议)",
        "🇸🇬 15新加坡-专线(iOS优化)",
        "🇸🇬 24新加坡-联通/移动(新协议)",
        "🇩🇪 16德国-电信/联通(新协议)",
        "🇬🇧 17英国-ChatGPT(新协议)",
        "🇨🇦 18加拿大-ChatGPT(新协议)",
        "🇦🇺 19悉尼-ChatGPT(新协议)",
        "🇧🇷 20巴西-ChatGPT(新协议)",
        "🇨🇱 21智利-ChatGPT(新协议)",
        "🇹🇷 22土耳其-电信/联通(新协议)",
        "🇫🇷 23法国-全网优化(新协议)",
        "🇭🇰 HK WSS",
        "🇹🇼 TW wss",
        "🇹🇼 TW tr",
        "🇹🇼 TW 1tr",
        "hk re",
        "🇺🇸 US tr",
        "🇬🇧 UK",
        "🇬🇪 GE wss",
        "tw h22",
        "🇭🇰 HK vmg",
        "tw vlt",
        "🇺🇸 US vmg",
        "🇬🇪 GE vmg",
        "🇬🇧 UK vmg",
        "🇭🇰 HK 1WSS",
        "🇹🇼 TW 1WSS",
        "🇺🇸 US WSS",
        "🇭🇰 HK 1TR",
        "tw vmg",
        "tw ws",
        "tw vlg",
        "tw re",
        "tw1 re",
        "CC1-01",
        "CC1-02",
        "CC1-03",
        "CC2-server ws1",
        "CC2-server ws2",
        "🇺🇸 US-WS1-1",
        "🇺🇸 US-WS1-2",
        "direct"
      ]
    },
    {
      "tag": "🌌 Google",
      "type": "selector",
      "outbounds": [
        "🎬 HK",
        "🎬 TW",
        "🎬 SG",
        "📺 JP",
        "📺 US",
        "📺 KR",
        "🧩auto",
        "hk tuic",
        "tuicv5",
        "tw",
        "tw h2",
        "hk",
        "🇩🇪 DE",
        "hk1",
        "tw 1",
        "hk 2",
        "ssv2ray",
        "ss",
        "test",
        "auto",
        "自动最优线路(新协议)-网址: dg1.top",
        "🇭🇰 1香港集群-全网优化(新协议)",
        "🇭🇰 1香港集群-全网优化(vmess)",
        "🇭🇰 2香港-专线(iOS优化)",
        "🇹🇼 5台湾-联通/移动(新协议)",
        "🇯🇵 6日本-东部优化(新协议)",
        "🇯🇵 7日本-联通/移动(新协议)",
        "🇰🇷 8韩国集群-全网优化(新协议)",
        "🇰🇷 8韩国集群-全网优化(vmess)",
        "🇰🇷 9韩国-全网优化(新协议)",
        "🇰🇷 9韩国-专线(iOS优化)",
        "🇯🇵 10日本(新协议)-全网优化",
        "🇯🇵 10日本-专线(iOS优化)",
        "🇺🇸 11美国-全网优化(新协议)",
        "🇺🇸 11美国-全网优化(iOS优化)",
        "🇺🇸 12美国凤凰城-ChatGPT(新协议)",
        "🇺🇸 12美国凤凰城-ChatGPT(vmess)",
        "🇦🇪 13迪拜-电信/移动/南方联通(新协议)",
        "🇮🇳 14印度-移动/南方联通(新协议)",
        "🇸🇬 15新加坡-全网优化(新协议)",
        "🇸🇬 15新加坡-专线(iOS优化)",
        "🇸🇬 24新加坡-联通/移动(新协议)",
        "🇩🇪 16德国-电信/联通(新协议)",
        "🇬🇧 17英国-ChatGPT(新协议)",
        "🇨🇦 18加拿大-ChatGPT(新协议)",
        "🇦🇺 19悉尼-ChatGPT(新协议)",
        "🇧🇷 20巴西-ChatGPT(新协议)",
        "🇨🇱 21智利-ChatGPT(新协议)",
        "🇹🇷 22土耳其-电信/联通(新协议)",
        "🇫🇷 23法国-全网优化(新协议)",
        "🇭🇰 HK WSS",
        "🇹🇼 TW wss",
        "🇹🇼 TW tr",
        "🇹🇼 TW 1tr",
        "hk re",
        "🇺🇸 US tr",
        "🇬🇧 UK",
        "🇬🇪 GE wss",
        "tw h22",
        "🇭🇰 HK vmg",
        "tw vlt",
        "🇺🇸 US vmg",
        "🇬🇪 GE vmg",
        "🇬🇧 UK vmg",
        "🇭🇰 HK 1WSS",
        "🇹🇼 TW 1WSS",
        "🇺🇸 US WSS",
        "🇭🇰 HK 1TR",
        "tw vmg",
        "tw ws",
        "tw vlg",
        "tw re",
        "tw1 re",
        "CC1-01",
        "CC1-02",
        "CC1-03",
        "CC2-server ws1",
        "CC2-server ws2",
        "🇺🇸 US-WS1-1",
        "🇺🇸 US-WS1-2",
        "direct"
      ]
    },
    {
      "tag": "📟 Telegram",
      "type": "selector",
      "outbounds": [
        "🎬 HK",
        "🎬 TW",
        "🎬 SG",
        "📺 JP",
        "📺 US",
        "📺 KR",
        "🧩auto",
        "hk tuic",
        "tuicv5",
        "tw",
        "tw h2",
        "hk",
        "🇩🇪 DE",
        "hk1",
        "tw 1",
        "hk 2",
        "ssv2ray",
        "ss",
        "test",
        "auto",
        "自动最优线路(新协议)-网址: dg1.top",
        "🇭🇰 1香港集群-全网优化(新协议)",
        "🇭🇰 1香港集群-全网优化(vmess)",
        "🇭🇰 2香港-专线(iOS优化)",
        "🇹🇼 5台湾-联通/移动(新协议)",
        "🇯🇵 6日本-东部优化(新协议)",
        "🇯🇵 7日本-联通/移动(新协议)",
        "🇰🇷 8韩国集群-全网优化(新协议)",
        "🇰🇷 8韩国集群-全网优化(vmess)",
        "🇰🇷 9韩国-全网优化(新协议)",
        "🇰🇷 9韩国-专线(iOS优化)",
        "🇯🇵 10日本(新协议)-全网优化",
        "🇯🇵 10日本-专线(iOS优化)",
        "🇺🇸 11美国-全网优化(新协议)",
        "🇺🇸 11美国-全网优化(iOS优化)",
        "🇺🇸 12美国凤凰城-ChatGPT(新协议)",
        "🇺🇸 12美国凤凰城-ChatGPT(vmess)",
        "🇦🇪 13迪拜-电信/移动/南方联通(新协议)",
        "🇮🇳 14印度-移动/南方联通(新协议)",
        "🇸🇬 15新加坡-全网优化(新协议)",
        "🇸🇬 15新加坡-专线(iOS优化)",
        "🇸🇬 24新加坡-联通/移动(新协议)",
        "🇩🇪 16德国-电信/联通(新协议)",
        "🇬🇧 17英国-ChatGPT(新协议)",
        "🇨🇦 18加拿大-ChatGPT(新协议)",
        "🇦🇺 19悉尼-ChatGPT(新协议)",
        "🇧🇷 20巴西-ChatGPT(新协议)",
        "🇨🇱 21智利-ChatGPT(新协议)",
        "🇹🇷 22土耳其-电信/联通(新协议)",
        "🇫🇷 23法国-全网优化(新协议)",
        "🇭🇰 HK WSS",
        "🇹🇼 TW wss",
        "🇹🇼 TW tr",
        "🇹🇼 TW 1tr",
        "hk re",
        "🇺🇸 US tr",
        "🇬🇧 UK",
        "🇬🇪 GE wss",
        "tw h22",
        "🇭🇰 HK vmg",
        "tw vlt",
        "🇺🇸 US vmg",
        "🇬🇪 GE vmg",
        "🇬🇧 UK vmg",
        "🇭🇰 HK 1WSS",
        "🇹🇼 TW 1WSS",
        "🇺🇸 US WSS",
        "🇭🇰 HK 1TR",
        "tw vmg",
        "tw ws",
        "tw vlg",
        "tw re",
        "tw1 re",
        "CC1-01",
        "CC1-02",
        "CC1-03",
        "CC2-server ws1",
        "CC2-server ws2",
        "🇺🇸 US-WS1-1",
        "🇺🇸 US-WS1-2",
        "direct"
      ]
    },
    {
      "tag": "🐦 Twitter",
      "type": "selector",
      "outbounds": [
        "🎬 HK",
        "🎬 TW",
        "🎬 SG",
        "📺 JP",
        "📺 US",
        "📺 KR",
        "🧩auto",
        "hk tuic",
        "tuicv5",
        "tw",
        "tw h2",
        "hk",
        "🇩🇪 DE",
        "hk1",
        "tw 1",
        "hk 2",
        "ssv2ray",
        "ss",
        "test",
        "auto",
        "自动最优线路(新协议)-网址: dg1.top",
        "🇭🇰 1香港集群-全网优化(新协议)",
        "🇭🇰 1香港集群-全网优化(vmess)",
        "🇭🇰 2香港-专线(iOS优化)",
        "🇹🇼 5台湾-联通/移动(新协议)",
        "🇯🇵 6日本-东部优化(新协议)",
        "🇯🇵 7日本-联通/移动(新协议)",
        "🇰🇷 8韩国集群-全网优化(新协议)",
        "🇰🇷 8韩国集群-全网优化(vmess)",
        "🇰🇷 9韩国-全网优化(新协议)",
        "🇰🇷 9韩国-专线(iOS优化)",
        "🇯🇵 10日本(新协议)-全网优化",
        "🇯🇵 10日本-专线(iOS优化)",
        "🇺🇸 11美国-全网优化(新协议)",
        "🇺🇸 11美国-全网优化(iOS优化)",
        "🇺🇸 12美国凤凰城-ChatGPT(新协议)",
        "🇺🇸 12美国凤凰城-ChatGPT(vmess)",
        "🇦🇪 13迪拜-电信/移动/南方联通(新协议)",
        "🇮🇳 14印度-移动/南方联通(新协议)",
        "🇸🇬 15新加坡-全网优化(新协议)",
        "🇸🇬 15新加坡-专线(iOS优化)",
        "🇸🇬 24新加坡-联通/移动(新协议)",
        "🇩🇪 16德国-电信/联通(新协议)",
        "🇬🇧 17英国-ChatGPT(新协议)",
        "🇨🇦 18加拿大-ChatGPT(新协议)",
        "🇦🇺 19悉尼-ChatGPT(新协议)",
        "🇧🇷 20巴西-ChatGPT(新协议)",
        "🇨🇱 21智利-ChatGPT(新协议)",
        "🇹🇷 22土耳其-电信/联通(新协议)",
        "🇫🇷 23法国-全网优化(新协议)",
        "🇭🇰 HK WSS",
        "🇹🇼 TW wss",
        "🇹🇼 TW tr",
        "🇹🇼 TW 1tr",
        "hk re",
        "🇺🇸 US tr",
        "🇬🇧 UK",
        "🇬🇪 GE wss",
        "tw h22",
        "🇭🇰 HK vmg",
        "tw vlt",
        "🇺🇸 US vmg",
        "🇬🇪 GE vmg",
        "🇬🇧 UK vmg",
        "🇭🇰 HK 1WSS",
        "🇹🇼 TW 1WSS",
        "🇺🇸 US WSS",
        "🇭🇰 HK 1TR",
        "tw vmg",
        "tw ws",
        "tw vlg",
        "tw re",
        "tw1 re",
        "CC1-01",
        "CC1-02",
        "CC1-03",
        "CC2-server ws1",
        "CC2-server ws2",
        "🇺🇸 US-WS1-1",
        "🇺🇸 US-WS1-2",
        "direct"
      ]
    },
    {
      "tag": "👤 Facebook",
      "type": "selector",
      "outbounds": [
        "🎬 HK",
        "🎬 TW",
        "🎬 SG",
        "📺 JP",
        "📺 US",
        "📺 KR",
        "🧩auto",
        "hk tuic",
        "tuicv5",
        "tw",
        "tw h2",
        "hk",
        "🇩🇪 DE",
        "hk1",
        "tw 1",
        "hk 2",
        "ssv2ray",
        "ss",
        "test",
        "auto",
        "自动最优线路(新协议)-网址: dg1.top",
        "🇭🇰 1香港集群-全网优化(新协议)",
        "🇭🇰 1香港集群-全网优化(vmess)",
        "🇭🇰 2香港-专线(iOS优化)",
        "🇹🇼 5台湾-联通/移动(新协议)",
        "🇯🇵 6日本-东部优化(新协议)",
        "🇯🇵 7日本-联通/移动(新协议)",
        "🇰🇷 8韩国集群-全网优化(新协议)",
        "🇰🇷 8韩国集群-全网优化(vmess)",
        "🇰🇷 9韩国-全网优化(新协议)",
        "🇰🇷 9韩国-专线(iOS优化)",
        "🇯🇵 10日本(新协议)-全网优化",
        "🇯🇵 10日本-专线(iOS优化)",
        "🇺🇸 11美国-全网优化(新协议)",
        "🇺🇸 11美国-全网优化(iOS优化)",
        "🇺🇸 12美国凤凰城-ChatGPT(新协议)",
        "🇺🇸 12美国凤凰城-ChatGPT(vmess)",
        "🇦🇪 13迪拜-电信/移动/南方联通(新协议)",
        "🇮🇳 14印度-移动/南方联通(新协议)",
        "🇸🇬 15新加坡-全网优化(新协议)",
        "🇸🇬 15新加坡-专线(iOS优化)",
        "🇸🇬 24新加坡-联通/移动(新协议)",
        "🇩🇪 16德国-电信/联通(新协议)",
        "🇬🇧 17英国-ChatGPT(新协议)",
        "🇨🇦 18加拿大-ChatGPT(新协议)",
        "🇦🇺 19悉尼-ChatGPT(新协议)",
        "🇧🇷 20巴西-ChatGPT(新协议)",
        "🇨🇱 21智利-ChatGPT(新协议)",
        "🇹🇷 22土耳其-电信/联通(新协议)",
        "🇫🇷 23法国-全网优化(新协议)",
        "🇭🇰 HK WSS",
        "🇹🇼 TW wss",
        "🇹🇼 TW tr",
        "🇹🇼 TW 1tr",
        "hk re",
        "🇺🇸 US tr",
        "🇬🇧 UK",
        "🇬🇪 GE wss",
        "tw h22",
        "🇭🇰 HK vmg",
        "tw vlt",
        "🇺🇸 US vmg",
        "🇬🇪 GE vmg",
        "🇬🇧 UK vmg",
        "🇭🇰 HK 1WSS",
        "🇹🇼 TW 1WSS",
        "🇺🇸 US WSS",
        "🇭🇰 HK 1TR",
        "tw vmg",
        "tw ws",
        "tw vlg",
        "tw re",
        "tw1 re",
        "CC1-01",
        "CC1-02",
        "CC1-03",
        "CC2-server ws1",
        "CC2-server ws2",
        "🇺🇸 US-WS1-1",
        "🇺🇸 US-WS1-2",
        "direct"
      ]
    },
    {
      "tag": "🛍️ Amazon",
      "type": "selector",
      "outbounds": [
        "🧩auto",
        "hk tuic",
        "tuicv5",
        "tw",
        "tw h2",
        "hk",
        "🇩🇪 DE",
        "hk1",
        "tw 1",
        "hk 2",
        "ssv2ray",
        "ss",
        "test",
        "auto",
        "自动最优线路(新协议)-网址: dg1.top",
        "🇭🇰 1香港集群-全网优化(新协议)",
        "🇭🇰 1香港集群-全网优化(vmess)",
        "🇭🇰 2香港-专线(iOS优化)",
        "🇹🇼 5台湾-联通/移动(新协议)",
        "🇯🇵 6日本-东部优化(新协议)",
        "🇯🇵 7日本-联通/移动(新协议)",
        "🇰🇷 8韩国集群-全网优化(新协议)",
        "🇰🇷 8韩国集群-全网优化(vmess)",
        "🇰🇷 9韩国-全网优化(新协议)",
        "🇰🇷 9韩国-专线(iOS优化)",
        "🇯🇵 10日本(新协议)-全网优化",
        "🇯🇵 10日本-专线(iOS优化)",
        "🇺🇸 11美国-全网优化(新协议)",
        "🇺🇸 11美国-全网优化(iOS优化)",
        "🇺🇸 12美国凤凰城-ChatGPT(新协议)",
        "🇺🇸 12美国凤凰城-ChatGPT(vmess)",
        "🇦🇪 13迪拜-电信/移动/南方联通(新协议)",
        "🇮🇳 14印度-移动/南方联通(新协议)",
        "🇸🇬 15新加坡-全网优化(新协议)",
        "🇸🇬 15新加坡-专线(iOS优化)",
        "🇸🇬 24新加坡-联通/移动(新协议)",
        "🇩🇪 16德国-电信/联通(新协议)",
        "🇬🇧 17英国-ChatGPT(新协议)",
        "🇨🇦 18加拿大-ChatGPT(新协议)",
        "🇦🇺 19悉尼-ChatGPT(新协议)",
        "🇧🇷 20巴西-ChatGPT(新协议)",
        "🇨🇱 21智利-ChatGPT(新协议)",
        "🇹🇷 22土耳其-电信/联通(新协议)",
        "🇫🇷 23法国-全网优化(新协议)",
        "🇭🇰 HK WSS",
        "🇹🇼 TW wss",
        "🇹🇼 TW tr",
        "🇹🇼 TW 1tr",
        "hk re",
        "🇺🇸 US tr",
        "🇬🇧 UK",
        "🇬🇪 GE wss",
        "tw h22",
        "🇭🇰 HK vmg",
        "tw vlt",
        "🇺🇸 US vmg",
        "🇬🇪 GE vmg",
        "🇬🇧 UK vmg",
        "🇭🇰 HK 1WSS",
        "🇹🇼 TW 1WSS",
        "🇺🇸 US WSS",
        "🇭🇰 HK 1TR",
        "tw vmg",
        "tw ws",
        "tw vlg",
        "tw re",
        "tw1 re",
        "CC1-01",
        "CC1-02",
        "CC1-03",
        "CC2-server ws1",
        "CC2-server ws2",
        "🇺🇸 US-WS1-1",
        "🇺🇸 US-WS1-2",
        "direct"
      ]
    },
    {
      "tag": "🍎 Apple",
      "type": "selector",
      "outbounds": [
        "🎬 HK",
        "🎬 TW",
        "🎬 SG",
        "📺 JP",
        "📺 US",
        "📺 KR",
        "🧩auto",
        "hk tuic",
        "tuicv5",
        "tw",
        "tw h2",
        "hk",
        "🇩🇪 DE",
        "hk1",
        "tw 1",
        "hk 2",
        "ssv2ray",
        "ss",
        "test",
        "auto",
        "自动最优线路(新协议)-网址: dg1.top",
        "🇭🇰 1香港集群-全网优化(新协议)",
        "🇭🇰 1香港集群-全网优化(vmess)",
        "🇭🇰 2香港-专线(iOS优化)",
        "🇹🇼 5台湾-联通/移动(新协议)",
        "🇯🇵 6日本-东部优化(新协议)",
        "🇯🇵 7日本-联通/移动(新协议)",
        "🇰🇷 8韩国集群-全网优化(新协议)",
        "🇰🇷 8韩国集群-全网优化(vmess)",
        "🇰🇷 9韩国-全网优化(新协议)",
        "🇰🇷 9韩国-专线(iOS优化)",
        "🇯🇵 10日本(新协议)-全网优化",
        "🇯🇵 10日本-专线(iOS优化)",
        "🇺🇸 11美国-全网优化(新协议)",
        "🇺🇸 11美国-全网优化(iOS优化)",
        "🇺🇸 12美国凤凰城-ChatGPT(新协议)",
        "🇺🇸 12美国凤凰城-ChatGPT(vmess)",
        "🇦🇪 13迪拜-电信/移动/南方联通(新协议)",
        "🇮🇳 14印度-移动/南方联通(新协议)",
        "🇸🇬 15新加坡-全网优化(新协议)",
        "🇸🇬 15新加坡-专线(iOS优化)",
        "🇸🇬 24新加坡-联通/移动(新协议)",
        "🇩🇪 16德国-电信/联通(新协议)",
        "🇬🇧 17英国-ChatGPT(新协议)",
        "🇨🇦 18加拿大-ChatGPT(新协议)",
        "🇦🇺 19悉尼-ChatGPT(新协议)",
        "🇧🇷 20巴西-ChatGPT(新协议)",
        "🇨🇱 21智利-ChatGPT(新协议)",
        "🇹🇷 22土耳其-电信/联通(新协议)",
        "🇫🇷 23法国-全网优化(新协议)",
        "🇭🇰 HK WSS",
        "🇹🇼 TW wss",
        "🇹🇼 TW tr",
        "🇹🇼 TW 1tr",
        "hk re",
        "🇺🇸 US tr",
        "🇬🇧 UK",
        "🇬🇪 GE wss",
        "tw h22",
        "🇭🇰 HK vmg",
        "tw vlt",
        "🇺🇸 US vmg",
        "🇬🇪 GE vmg",
        "🇬🇧 UK vmg",
        "🇭🇰 HK 1WSS",
        "🇹🇼 TW 1WSS",
        "🇺🇸 US WSS",
        "🇭🇰 HK 1TR",
        "tw vmg",
        "tw ws",
        "tw vlg",
        "tw re",
        "tw1 re",
        "CC1-01",
        "CC1-02",
        "CC1-03",
        "CC2-server ws1",
        "CC2-server ws2",
        "🇺🇸 US-WS1-1",
        "🇺🇸 US-WS1-2",
        "direct"
      ]
    },
    {
      "tag": "🧩 Microsoft",
      "type": "selector",
      "outbounds": [
        "🧩auto",
        "hk tuic",
        "tuicv5",
        "tw",
        "tw h2",
        "hk",
        "🇩🇪 DE",
        "hk1",
        "tw 1",
        "hk 2",
        "ssv2ray",
        "ss",
        "test",
        "auto",
        "自动最优线路(新协议)-网址: dg1.top",
        "🇭🇰 1香港集群-全网优化(新协议)",
        "🇭🇰 1香港集群-全网优化(vmess)",
        "🇭🇰 2香港-专线(iOS优化)",
        "🇹🇼 5台湾-联通/移动(新协议)",
        "🇯🇵 6日本-东部优化(新协议)",
        "🇯🇵 7日本-联通/移动(新协议)",
        "🇰🇷 8韩国集群-全网优化(新协议)",
        "🇰🇷 8韩国集群-全网优化(vmess)",
        "🇰🇷 9韩国-全网优化(新协议)",
        "🇰🇷 9韩国-专线(iOS优化)",
        "🇯🇵 10日本(新协议)-全网优化",
        "🇯🇵 10日本-专线(iOS优化)",
        "🇺🇸 11美国-全网优化(新协议)",
        "🇺🇸 11美国-全网优化(iOS优化)",
        "🇺🇸 12美国凤凰城-ChatGPT(新协议)",
        "🇺🇸 12美国凤凰城-ChatGPT(vmess)",
        "🇦🇪 13迪拜-电信/移动/南方联通(新协议)",
        "🇮🇳 14印度-移动/南方联通(新协议)",
        "🇸🇬 15新加坡-全网优化(新协议)",
        "🇸🇬 15新加坡-专线(iOS优化)",
        "🇸🇬 24新加坡-联通/移动(新协议)",
        "🇩🇪 16德国-电信/联通(新协议)",
        "🇬🇧 17英国-ChatGPT(新协议)",
        "🇨🇦 18加拿大-ChatGPT(新协议)",
        "🇦🇺 19悉尼-ChatGPT(新协议)",
        "🇧🇷 20巴西-ChatGPT(新协议)",
        "🇨🇱 21智利-ChatGPT(新协议)",
        "🇹🇷 22土耳其-电信/联通(新协议)",
        "🇫🇷 23法国-全网优化(新协议)",
        "🇭🇰 HK WSS",
        "🇹🇼 TW wss",
        "🇹🇼 TW tr",
        "🇹🇼 TW 1tr",
        "hk re",
        "🇺🇸 US tr",
        "🇬🇧 UK",
        "🇬🇪 GE wss",
        "tw h22",
        "🇭🇰 HK vmg",
        "tw vlt",
        "🇺🇸 US vmg",
        "🇬🇪 GE vmg",
        "🇬🇧 UK vmg",
        "🇭🇰 HK 1WSS",
        "🇹🇼 TW 1WSS",
        "🇺🇸 US WSS",
        "🇭🇰 HK 1TR",
        "tw vmg",
        "tw ws",
        "tw vlg",
        "tw re",
        "tw1 re",
        "CC1-01",
        "CC1-02",
        "CC1-03",
        "CC2-server ws1",
        "CC2-server ws2",
        "🇺🇸 US-WS1-1",
        "🇺🇸 US-WS1-2",
        "direct"
      ]
    },
    {
      "tag": "🎮 Game",
      "type": "selector",
      "outbounds": [
        "🧩auto",
        "hk tuic",
        "tuicv5",
        "tw",
        "tw h2",
        "hk",
        "🇩🇪 DE",
        "hk1",
        "tw 1",
        "hk 2",
        "ssv2ray",
        "ss",
        "test",
        "auto",
        "自动最优线路(新协议)-网址: dg1.top",
        "🇭🇰 1香港集群-全网优化(新协议)",
        "🇭🇰 1香港集群-全网优化(vmess)",
        "🇭🇰 2香港-专线(iOS优化)",
        "🇹🇼 5台湾-联通/移动(新协议)",
        "🇯🇵 6日本-东部优化(新协议)",
        "🇯🇵 7日本-联通/移动(新协议)",
        "🇰🇷 8韩国集群-全网优化(新协议)",
        "🇰🇷 8韩国集群-全网优化(vmess)",
        "🇰🇷 9韩国-全网优化(新协议)",
        "🇰🇷 9韩国-专线(iOS优化)",
        "🇯🇵 10日本(新协议)-全网优化",
        "🇯🇵 10日本-专线(iOS优化)",
        "🇺🇸 11美国-全网优化(新协议)",
        "🇺🇸 11美国-全网优化(iOS优化)",
        "🇺🇸 12美国凤凰城-ChatGPT(新协议)",
        "🇺🇸 12美国凤凰城-ChatGPT(vmess)",
        "🇦🇪 13迪拜-电信/移动/南方联通(新协议)",
        "🇮🇳 14印度-移动/南方联通(新协议)",
        "🇸🇬 15新加坡-全网优化(新协议)",
        "🇸🇬 15新加坡-专线(iOS优化)",
        "🇸🇬 24新加坡-联通/移动(新协议)",
        "🇩🇪 16德国-电信/联通(新协议)",
        "🇬🇧 17英国-ChatGPT(新协议)",
        "🇨🇦 18加拿大-ChatGPT(新协议)",
        "🇦🇺 19悉尼-ChatGPT(新协议)",
        "🇧🇷 20巴西-ChatGPT(新协议)",
        "🇨🇱 21智利-ChatGPT(新协议)",
        "🇹🇷 22土耳其-电信/联通(新协议)",
        "🇫🇷 23法国-全网优化(新协议)",
        "🇭🇰 HK WSS",
        "🇹🇼 TW wss",
        "🇹🇼 TW tr",
        "🇹🇼 TW 1tr",
        "hk re",
        "🇺🇸 US tr",
        "🇬🇧 UK",
        "🇬🇪 GE wss",
        "tw h22",
        "🇭🇰 HK vmg",
        "tw vlt",
        "🇺🇸 US vmg",
        "🇬🇪 GE vmg",
        "🇬🇧 UK vmg",
        "🇭🇰 HK 1WSS",
        "🇹🇼 TW 1WSS",
        "🇺🇸 US WSS",
        "🇭🇰 HK 1TR",
        "tw vmg",
        "tw ws",
        "tw vlg",
        "tw re",
        "tw1 re",
        "CC1-01",
        "CC1-02",
        "CC1-03",
        "CC2-server ws1",
        "CC2-server ws2",
        "🇺🇸 US-WS1-1",
        "🇺🇸 US-WS1-2",
        "direct"
      ]
    },
    {
      "tag": "📺 Bilibili",
      "type": "selector",
      "outbounds": [
        "🧩auto",
        "hk tuic",
        "tuicv5",
        "tw",
        "tw h2",
        "hk",
        "🇩🇪 DE",
        "hk1",
        "tw 1",
        "hk 2",
        "ssv2ray",
        "ss",
        "test",
        "auto",
        "自动最优线路(新协议)-网址: dg1.top",
        "🇭🇰 1香港集群-全网优化(新协议)",
        "🇭🇰 1香港集群-全网优化(vmess)",
        "🇭🇰 2香港-专线(iOS优化)",
        "🇹🇼 5台湾-联通/移动(新协议)",
        "🇯🇵 6日本-东部优化(新协议)",
        "🇯🇵 7日本-联通/移动(新协议)",
        "🇰🇷 8韩国集群-全网优化(新协议)",
        "🇰🇷 8韩国集群-全网优化(vmess)",
        "🇰🇷 9韩国-全网优化(新协议)",
        "🇰🇷 9韩国-专线(iOS优化)",
        "🇯🇵 10日本(新协议)-全网优化",
        "🇯🇵 10日本-专线(iOS优化)",
        "🇺🇸 11美国-全网优化(新协议)",
        "🇺🇸 11美国-全网优化(iOS优化)",
        "🇺🇸 12美国凤凰城-ChatGPT(新协议)",
        "🇺🇸 12美国凤凰城-ChatGPT(vmess)",
        "🇦🇪 13迪拜-电信/移动/南方联通(新协议)",
        "🇮🇳 14印度-移动/南方联通(新协议)",
        "🇸🇬 15新加坡-全网优化(新协议)",
        "🇸🇬 15新加坡-专线(iOS优化)",
        "🇸🇬 24新加坡-联通/移动(新协议)",
        "🇩🇪 16德国-电信/联通(新协议)",
        "🇬🇧 17英国-ChatGPT(新协议)",
        "🇨🇦 18加拿大-ChatGPT(新协议)",
        "🇦🇺 19悉尼-ChatGPT(新协议)",
        "🇧🇷 20巴西-ChatGPT(新协议)",
        "🇨🇱 21智利-ChatGPT(新协议)",
        "🇹🇷 22土耳其-电信/联通(新协议)",
        "🇫🇷 23法国-全网优化(新协议)",
        "🇭🇰 HK WSS",
        "🇹🇼 TW wss",
        "🇹🇼 TW tr",
        "🇹🇼 TW 1tr",
        "hk re",
        "🇺🇸 US tr",
        "🇬🇧 UK",
        "🇬🇪 GE wss",
        "tw h22",
        "🇭🇰 HK vmg",
        "tw vlt",
        "🇺🇸 US vmg",
        "🇬🇪 GE vmg",
        "🇬🇧 UK vmg",
        "🇭🇰 HK 1WSS",
        "🇹🇼 TW 1WSS",
        "🇺🇸 US WSS",
        "🇭🇰 HK 1TR",
        "tw vmg",
        "tw ws",
        "tw vlg",
        "tw re",
        "tw1 re",
        "CC1-01",
        "CC1-02",
        "CC1-03",
        "CC2-server ws1",
        "CC2-server ws2",
        "🇺🇸 US-WS1-1",
        "🇺🇸 US-WS1-2",
        "direct"
      ]
    },
    {
      "tag": "🎬 MediaVideo",
      "type": "selector",
      "outbounds": [
        "🧩auto",
        "hk tuic",
        "tuicv5",
        "tw",
        "tw h2",
        "hk",
        "🇩🇪 DE",
        "hk1",
        "tw 1",
        "hk 2",
        "ssv2ray",
        "ss",
        "test",
        "auto",
        "自动最优线路(新协议)-网址: dg1.top",
        "🇭🇰 1香港集群-全网优化(新协议)",
        "🇭🇰 1香港集群-全网优化(vmess)",
        "🇭🇰 2香港-专线(iOS优化)",
        "🇹🇼 5台湾-联通/移动(新协议)",
        "🇯🇵 6日本-东部优化(新协议)",
        "🇯🇵 7日本-联通/移动(新协议)",
        "🇰🇷 8韩国集群-全网优化(新协议)",
        "🇰🇷 8韩国集群-全网优化(vmess)",
        "🇰🇷 9韩国-全网优化(新协议)",
        "🇰🇷 9韩国-专线(iOS优化)",
        "🇯🇵 10日本(新协议)-全网优化",
        "🇯🇵 10日本-专线(iOS优化)",
        "🇺🇸 11美国-全网优化(新协议)",
        "🇺🇸 11美国-全网优化(iOS优化)",
        "🇺🇸 12美国凤凰城-ChatGPT(新协议)",
        "🇺🇸 12美国凤凰城-ChatGPT(vmess)",
        "🇦🇪 13迪拜-电信/移动/南方联通(新协议)",
        "🇮🇳 14印度-移动/南方联通(新协议)",
        "🇸🇬 15新加坡-全网优化(新协议)",
        "🇸🇬 15新加坡-专线(iOS优化)",
        "🇸🇬 24新加坡-联通/移动(新协议)",
        "🇩🇪 16德国-电信/联通(新协议)",
        "🇬🇧 17英国-ChatGPT(新协议)",
        "🇨🇦 18加拿大-ChatGPT(新协议)",
        "🇦🇺 19悉尼-ChatGPT(新协议)",
        "🇧🇷 20巴西-ChatGPT(新协议)",
        "🇨🇱 21智利-ChatGPT(新协议)",
        "🇹🇷 22土耳其-电信/联通(新协议)",
        "🇫🇷 23法国-全网优化(新协议)",
        "🇭🇰 HK WSS",
        "🇹🇼 TW wss",
        "🇹🇼 TW tr",
        "🇹🇼 TW 1tr",
        "hk re",
        "🇺🇸 US tr",
        "🇬🇧 UK",
        "🇬🇪 GE wss",
        "tw h22",
        "🇭🇰 HK vmg",
        "tw vlt",
        "🇺🇸 US vmg",
        "🇬🇪 GE vmg",
        "🇬🇧 UK vmg",
        "🇭🇰 HK 1WSS",
        "🇹🇼 TW 1WSS",
        "🇺🇸 US WSS",
        "🇭🇰 HK 1TR",
        "tw vmg",
        "tw ws",
        "tw vlg",
        "tw re",
        "tw1 re",
        "CC1-01",
        "CC1-02",
        "CC1-03",
        "CC2-server ws1",
        "CC2-server ws2",
        "🇺🇸 US-WS1-1",
        "🇺🇸 US-WS1-2",
        "direct"
      ]
    },
    {
      "tag": "🌏 !cn",
      "type": "selector",
      "outbounds": [
        "🎬 HK",
        "🎬 TW",
        "🎬 SG",
        "📺 JP",
        "📺 US",
        "📺 KR",
        "🧩auto",
        "hk tuic",
        "tuicv5",
        "tw",
        "tw h2",
        "hk",
        "🇩🇪 DE",
        "hk1",
        "tw 1",
        "hk 2",
        "ssv2ray",
        "ss",
        "test",
        "auto",
        "自动最优线路(新协议)-网址: dg1.top",
        "🇭🇰 1香港集群-全网优化(新协议)",
        "🇭🇰 1香港集群-全网优化(vmess)",
        "🇭🇰 2香港-专线(iOS优化)",
        "🇹🇼 5台湾-联通/移动(新协议)",
        "🇯🇵 6日本-东部优化(新协议)",
        "🇯🇵 7日本-联通/移动(新协议)",
        "🇰🇷 8韩国集群-全网优化(新协议)",
        "🇰🇷 8韩国集群-全网优化(vmess)",
        "🇰🇷 9韩国-全网优化(新协议)",
        "🇰🇷 9韩国-专线(iOS优化)",
        "🇯🇵 10日本(新协议)-全网优化",
        "🇯🇵 10日本-专线(iOS优化)",
        "🇺🇸 11美国-全网优化(新协议)",
        "🇺🇸 11美国-全网优化(iOS优化)",
        "🇺🇸 12美国凤凰城-ChatGPT(新协议)",
        "🇺🇸 12美国凤凰城-ChatGPT(vmess)",
        "🇦🇪 13迪拜-电信/移动/南方联通(新协议)",
        "🇮🇳 14印度-移动/南方联通(新协议)",
        "🇸🇬 15新加坡-全网优化(新协议)",
        "🇸🇬 15新加坡-专线(iOS优化)",
        "🇸🇬 24新加坡-联通/移动(新协议)",
        "🇩🇪 16德国-电信/联通(新协议)",
        "🇬🇧 17英国-ChatGPT(新协议)",
        "🇨🇦 18加拿大-ChatGPT(新协议)",
        "🇦🇺 19悉尼-ChatGPT(新协议)",
        "🇧🇷 20巴西-ChatGPT(新协议)",
        "🇨🇱 21智利-ChatGPT(新协议)",
        "🇹🇷 22土耳其-电信/联通(新协议)",
        "🇫🇷 23法国-全网优化(新协议)",
        "🇭🇰 HK WSS",
        "🇹🇼 TW wss",
        "🇹🇼 TW tr",
        "🇹🇼 TW 1tr",
        "hk re",
        "🇺🇸 US tr",
        "🇬🇧 UK",
        "🇬🇪 GE wss",
        "tw h22",
        "🇭🇰 HK vmg",
        "tw vlt",
        "🇺🇸 US vmg",
        "🇬🇪 GE vmg",
        "🇬🇧 UK vmg",
        "🇭🇰 HK 1WSS",
        "🇹🇼 TW 1WSS",
        "🇺🇸 US WSS",
        "🇭🇰 HK 1TR",
        "tw vmg",
        "tw ws",
        "tw vlg",
        "tw re",
        "tw1 re",
        "CC1-01",
        "CC1-02",
        "CC1-03",
        "CC2-server ws1",
        "CC2-server ws2",
        "🇺🇸 US-WS1-1",
        "🇺🇸 US-WS1-2",
        "direct"
      ]
    },
    {
      "tag": "🧩auto",
      "type": "urltest",
      "outbounds": [
        "hk tuic",
        "tuicv5",
        "tw",
        "tw h2",
        "hk",
        "🇩🇪 DE",
        "hk1",
        "tw 1",
        "hk 2",
        "ssv2ray",
        "ss",
        "自动最优线路(新协议)-网址: dg1.top",
        "🇭🇰 1香港集群-全网优化(新协议)",
        "🇭🇰 1香港集群-全网优化(vmess)",
        "🇭🇰 2香港-专线(iOS优化)",
        "🇹🇼 5台湾-联通/移动(新协议)",
        "🇯🇵 6日本-东部优化(新协议)",
        "🇯🇵 7日本-联通/移动(新协议)",
        "🇰🇷 8韩国集群-全网优化(新协议)",
        "🇰🇷 8韩国集群-全网优化(vmess)",
        "🇰🇷 9韩国-全网优化(新协议)",
        "🇰🇷 9韩国-专线(iOS优化)",
        "🇯🇵 10日本(新协议)-全网优化",
        "🇯🇵 10日本-专线(iOS优化)",
        "🇺🇸 11美国-全网优化(新协议)",
        "🇺🇸 11美国-全网优化(iOS优化)",
        "🇺🇸 12美国凤凰城-ChatGPT(新协议)",
        "🇺🇸 12美国凤凰城-ChatGPT(vmess)",
        "🇦🇪 13迪拜-电信/移动/南方联通(新协议)",
        "🇮🇳 14印度-移动/南方联通(新协议)",
        "🇸🇬 15新加坡-全网优化(新协议)",
        "🇸🇬 15新加坡-专线(iOS优化)",
        "🇸🇬 24新加坡-联通/移动(新协议)",
        "🇩🇪 16德国-电信/联通(新协议)",
        "🇬🇧 17英国-ChatGPT(新协议)",
        "🇨🇦 18加拿大-ChatGPT(新协议)",
        "🇦🇺 19悉尼-ChatGPT(新协议)",
        "🇧🇷 20巴西-ChatGPT(新协议)",
        "🇨🇱 21智利-ChatGPT(新协议)",
        "🇹🇷 22土耳其-电信/联通(新协议)",
        "🇫🇷 23法国-全网优化(新协议)",
        "🇭🇰 HK WSS",
        "🇹🇼 TW wss",
        "🇹🇼 TW tr",
        "🇹🇼 TW 1tr",
        "hk re",
        "🇺🇸 US tr",
        "🇬🇧 UK",
        "🇬🇪 GE wss",
        "tw h22",
        "🇭🇰 HK vmg",
        "tw vlt",
        "🇺🇸 US vmg",
        "🇬🇪 GE vmg",
        "🇬🇧 UK vmg",
        "🇭🇰 HK 1WSS",
        "🇹🇼 TW 1WSS",
        "🇺🇸 US WSS",
        "🇭🇰 HK 1TR",
        "tw vmg",
        "tw ws",
        "tw vlg",
        "tw re",
        "tw1 re",
        "CC1-01",
        "CC1-02",
        "CC1-03",
        "CC2-server ws1",
        "CC2-server ws2",
        "🇺🇸 US-WS1-1",
        "🇺🇸 US-WS1-2"
      ]
    },
    {
      "tag": "🎬 HK",
      "type": "urltest",
      "outbounds": [
        "hk tuic",
        "hk",
        "hk1",
        "hk 2",
        "🇭🇰 1香港集群-全网优化(新协议)",
        "🇭🇰 1香港集群-全网优化(vmess)",
        "🇭🇰 2香港-专线(iOS优化)",
        "🇭🇰 HK WSS",
        "hk re",
        "🇭🇰 HK vmg",
        "🇭🇰 HK 1WSS",
        "🇭🇰 HK 1TR"
      ]
    },
    {
      "tag": "🎬 TW",
      "type": "urltest",
      "outbounds": [
        "tw",
        "tw h2",
        "tw 1",
        "🇹🇼 5台湾-联通/移动(新协议)",
        "🇹🇼 TW wss",
        "🇹🇼 TW tr",
        "🇹🇼 TW 1tr",
        "tw h22",
        "tw vlt",
        "🇹🇼 TW 1WSS",
        "tw vmg",
        "tw ws",
        "tw vlg",
        "tw re",
        "tw1 re"
      ]
    },
    {
      "tag": "🎬 SG",
      "type": "urltest",
      "outbounds": [
        "🇸🇬 15新加坡-全网优化(新协议)",
        "🇸🇬 15新加坡-专线(iOS优化)",
        "🇸🇬 24新加坡-联通/移动(新协议)"
      ]
    },
    {
      "tag": "📺 JP",
      "type": "urltest",
      "outbounds": [
        "🇯🇵 6日本-东部优化(新协议)",
        "🇯🇵 7日本-联通/移动(新协议)",
        "🇯🇵 10日本(新协议)-全网优化",
        "🇯🇵 10日本-专线(iOS优化)"
      ]
    },
    {
      "tag": "📺 US",
      "type": "urltest",
      "outbounds": [
        "🇺🇸 11美国-全网优化(新协议)",
        "🇺🇸 11美国-全网优化(iOS优化)",
        "🇺🇸 12美国凤凰城-ChatGPT(新协议)",
        "🇺🇸 12美国凤凰城-ChatGPT(vmess)",
        "🇺🇸 US tr",
        "🇺🇸 US vmg",
        "🇺🇸 US WSS",
        "🇺🇸 US-WS1-1",
        "🇺🇸 US-WS1-2"
      ]
    },
    {
      "tag": "📺 KR",
      "type": "urltest",
      "outbounds": [
        "🇰🇷 8韩国集群-全网优化(新协议)",
        "🇰🇷 8韩国集群-全网优化(vmess)",
        "🇰🇷 9韩国-全网优化(新协议)",
        "🇰🇷 9韩国-专线(iOS优化)"
      ]
    },
    {
      "tag": "test",
      "type": "selector",
      "outbounds": [
        "hk tuic",
        "tuicv5",
        "tw",
        "tw h2",
        "hk",
        "DE",
        "hk1",
        "tw 1",
        "hk 2",
        "ssv2ray",
        "ss"
      ]
    },
    {
      "tag": "auto",
      "type": "selector",
      "outbounds": [
        "自动最优线路(新协议)-网址: dg1.top",
        "1香港集群-全网优化(新协议)",
        "1香港集群-全网优化(vmess)",
        "2香港-专线(iOS优化)",
        "5台湾-联通/移动(新协议)",
        "6日本-东部优化(新协议)",
        "7日本-联通/移动(新协议)",
        "8韩国集群-全网优化(新协议)",
        "8韩国集群-全网优化(vmess)",
        "9韩国-全网优化(新协议)",
        "9韩国-专线(iOS优化)",
        "10日本(新协议)-全网优化",
        "10日本-专线(iOS优化)",
        "11美国-全网优化(新协议)",
        "11美国-全网优化(iOS优化)",
        "12美国凤凰城-ChatGPT(新协议)",
        "12美国凤凰城-ChatGPT(vmess)",
        "13迪拜-电信/移动/南方联通(新协议)",
        "14印度-移动/南方联通(新协议)",
        "15新加坡-全网优化(新协议)",
        "15新加坡-专线(iOS优化)",
        "24新加坡-联通/移动(新协议)",
        "16德国-电信/联通(新协议)",
        "17英国-ChatGPT(新协议)",
        "18加拿大-ChatGPT(新协议)",
        "19悉尼-ChatGPT(新协议)",
        "20巴西-ChatGPT(新协议)",
        "21智利-ChatGPT(新协议)",
        "22土耳其-电信/联通(新协议)",
        "23法国-全网优化(新协议)"
      ]
    },
    {
      "type": "direct",
      "tag": "direct"
    },
    {
      "type": "dns",
      "tag": "dns-out"
    },
    {
      "type": "block",
      "tag": "block"
    },
    {
      "password": "0bb30e83-da88-4d0f-adac-551ed82e7947",
      "server": "yicanny.com",
      "server_port": 2099,
      "tag": "hk tuic",
      "tls": {
        "enabled": true,
        "server_name": "yicanny.com",
        "alpn": [
          "h3"
        ]
      },
      "type": "tuic",
      "uuid": "0bb30e83-da88-4d0f-adac-551ed82e7947",
      "udp_relay_mode": "native",
      "zero_rtt_handshake": true,
      "heartbeat": "0ms"
    },
    {
      "password": "TUIC",
      "server": "108.165.169.213",
      "server_port": 8443,
      "tag": "tuicv5",
      "tls": {
        "enabled": true,
        "server_name": "cdn.divineengine.net",
        "alpn": [
          "h3"
        ]
      },
      "type": "tuic",
      "uuid": "8029997D-2954-4125-9743-EA75F88C0C15",
      "udp_relay_mode": "native",
      "zero_rtt_handshake": true,
      "heartbeat": "0ms"
    },
    {
      "server": "104.155.212.127",
      "server_port": 20357,
      "tag": "tw",
      "tls": {
        "enabled": true,
        "server_name": "wechat.com",
        "alpn": [
          "h3"
        ],
        "insecure": true
      },
      "type": "hysteria",
      "auth_str": "freekkk",
      "down_mbps": 110,
      "up_mbps": 19,
      "obfs": "freekkk"
    },
    {
      "server": "tw1.yicanny.com",
      "server_port": 2053,
      "tag": "tw h2",
      "tls": {
        "enabled": true,
        "server_name": "tw1.yicanny.com"
      },
      "transport": {
        "path": "/ck5aeJIX/",
        "type": "http"
      },
      "type": "vmess",
      "security": "auto",
      "uuid": "3ff1a03a-5966-11ec-a844-42010a8c0022"
    },
    {
      "server": "hk.yicanny.com",
      "server_port": 17879,
      "tag": "hk",
      "tls": {
        "enabled": true,
        "server_name": "hk.yicanny.com",
        "alpn": [
          "h3"
        ]
      },
      "type": "hysteria",
      "auth_str": "freekkk",
      "down_mbps": 110,
      "up_mbps": 19
    },
    {
      "server": "de.yicanny.com",
      "server_port": 20888,
      "tag": "🇩🇪 DE",
      "tls": {
        "enabled": true,
        "server_name": "de.yicanny.com",
        "alpn": [
          "h3"
        ]
      },
      "type": "hysteria",
      "auth_str": "frekkk",
      "down_mbps": 110,
      "up_mbps": 110
    },
    {
      "server": "hk2.yicanny.com",
      "server_port": 20666,
      "tag": "hk1",
      "tls": {
        "enabled": true,
        "server_name": "hk2.yicanny.com",
        "alpn": [
          "h3"
        ]
      },
      "type": "hysteria",
      "auth_str": "freekkk",
      "down_mbps": 110,
      "up_mbps": 19
    },
    {
      "server": "tw2.yicanny.com",
      "server_port": 20777,
      "tag": "tw 1",
      "tls": {
        "enabled": true,
        "server_name": "tw2.yicanny.com",
        "alpn": [
          "h3"
        ]
      },
      "type": "hysteria",
      "auth_str": "freekkk",
      "down_mbps": 110,
      "up_mbps": 19
    },
    {
      "server": "yicanny.com",
      "server_port": 20167,
      "tag": "hk 2",
      "tls": {
        "enabled": true,
        "server_name": "yicanny.com",
        "alpn": [
          "h3"
        ]
      },
      "type": "hysteria",
      "auth_str": "freekkk",
      "down_mbps": 110,
      "up_mbps": 19
    },
    {
      "password": "duckduckgo",
      "tag": "ssv2ray",
      "type": "shadowsocks",
      "method": "aes-256-gcm",
      "network": "tcp",
      "detour": "ssv2ray-shadowtls"
    },
        {
            "password": "duckduckgo",
            "server": "50.114.242.11",
            "server_port": 8443,
            "tag": "ssv2ray-shadowtls",
            "tls": {
                "enabled": true,
                "server_name": "cloud.tencent.com",
                "insecure": true,
                "utls": {
                    "enabled": true,
                    "fingerprint": "chrome"
                }
            },
            "type": "shadowtls",
            "version": 3
    },
    {
      "password": "https://t.me/nekoemtp",
      "server": "ss.a.nekoe.eu.org",
      "server_port": 6000,
      "tag": "ss",
      "type": "shadowsocks",
      "method": "aes-256-cfb",
      "network": "tcp"
    },
    {
      "type": "hysteria",
      "tag": "自动最优线路(新协议)-网址: dg1.top",
      "server": "cluster.prometheusnet01.xyz",
      "server_port": 4430,
      "up_mbps": 80,
      "down_mbps": 150,
      "auth_str": "8e431636-d42f-470f-9f67-11895d18d19a",
      "disable_mtu_discovery": true,
      "tls": {
        "alpn": [
          "h3"
        ],
        "enabled": true,
        "disable_sni": true,
        "insecure": true,
        "server_name": "cluster.prometheusnet01.xyz"
      }
    },
    {
      "type": "hysteria",
      "tag": "🇭🇰 1香港集群-全网优化(新协议)",
      "server": "1hk.prometheusnet01.xyz",
      "server_port": 4430,
      "up_mbps": 30,
      "down_mbps": 30,
      "auth_str": "8e431636-d42f-470f-9f67-11895d18d19a",
      "disable_mtu_discovery": true,
      "tls": {
        "alpn": [
          "h3"
        ],
        "enabled": true,
        "disable_sni": true,
        "insecure": true,
        "server_name": "1hk.prometheusnet01.xyz"
      }
    },
    {
      "type": "vmess",
      "tag": "🇭🇰 1香港集群-全网优化(vmess)",
      "server": "1hk.prometheusnet01.xyz",
      "server_port": 17848,
      "uuid": "8e431636-d42f-470f-9f67-11895d18d19a",
      "network": "tcp",
      "alter_id": 0
    },
    {
      "type": "shadowsocks",
      "tag": "🇭🇰 2香港-专线(iOS优化)",
      "server": "dnsmart.dg-cdn.mob.networklinkpro.com",
      "server_port": 17880,
      "method": "chacha20-ietf-poly1305",
      "password": "8e431636-d42f-470f-9f67-11895d18d19a"
    },
    {
      "type": "hysteria",
      "tag": "🇹🇼 5台湾-联通/移动(新协议)",
      "server": "5tw.prometheusnet01.xyz",
      "server_port": 4433,
      "up_mbps": 80,
      "down_mbps": 150,
      "auth_str": "8e431636-d42f-470f-9f67-11895d18d19a",
      "disable_mtu_discovery": true,
      "tls": {
        "alpn": [
          "h3"
        ],
        "enabled": true,
        "disable_sni": true,
        "insecure": true,
        "server_name": "5tw.prometheusnet01.xyz"
      }
    },
    {
      "type": "hysteria",
      "tag": "🇯🇵 6日本-东部优化(新协议)",
      "server": "6jp.prometheusnet01.xyz",
      "server_port": 4430,
      "up_mbps": 80,
      "down_mbps": 150,
      "auth_str": "8e431636-d42f-470f-9f67-11895d18d19a",
      "disable_mtu_discovery": true,
      "tls": {
        "alpn": [
          "h3"
        ],
        "enabled": true,
        "disable_sni": true,
        "insecure": true,
        "server_name": "6jp.prometheusnet01.xyz"
      }
    },
    {
      "type": "hysteria",
      "tag": "🇯🇵 7日本-联通/移动(新协议)",
      "server": "7jp.prometheusnet01.xyz",
      "server_port": 4430,
      "up_mbps": 80,
      "down_mbps": 150,
      "auth_str": "8e431636-d42f-470f-9f67-11895d18d19a",
      "disable_mtu_discovery": true,
      "tls": {
        "alpn": [
          "h3"
        ],
        "enabled": true,
        "disable_sni": true,
        "insecure": true,
        "server_name": "7jp.prometheusnet01.xyz"
      }
    },
    {
      "type": "hysteria",
      "tag": "🇰🇷 8韩国集群-全网优化(新协议)",
      "server": "8kr.prometheusnet01.xyz",
      "server_port": 4430,
      "up_mbps": 80,
      "down_mbps": 150,
      "auth_str": "8e431636-d42f-470f-9f67-11895d18d19a",
      "disable_mtu_discovery": true,
      "tls": {
        "alpn": [
          "h3"
        ],
        "enabled": true,
        "disable_sni": true,
        "insecure": true,
        "server_name": "8kr.prometheusnet01.xyz"
      }
    },
    {
      "type": "vmess",
      "tag": "🇰🇷 8韩国集群-全网优化(vmess)",
      "server": "8kr.prometheusnet01.xyz",
      "server_port": 17848,
      "uuid": "8e431636-d42f-470f-9f67-11895d18d19a",
      "network": "tcp",
      "alter_id": 0,
      "tls": {
        "enabled": true
      }
    },
    {
      "type": "hysteria",
      "tag": "🇰🇷 9韩国-全网优化(新协议)",
      "server": "9kr.prometheusnet01.xyz",
      "server_port": 4430,
      "up_mbps": 80,
      "down_mbps": 150,
      "auth_str": "8e431636-d42f-470f-9f67-11895d18d19a",
      "disable_mtu_discovery": true,
      "tls": {
        "alpn": [
          "h3"
        ],
        "enabled": true,
        "disable_sni": true,
        "insecure": true,
        "server_name": "9kr.prometheusnet01.xyz"
      }
    },
    {
      "type": "shadowsocks",
      "tag": "🇰🇷 9韩国-专线(iOS优化)",
      "server": "dnsmart.dg-cdn.mob.networklinkpro.com",
      "server_port": 17881,
      "method": "chacha20-ietf-poly1305",
      "password": "8e431636-d42f-470f-9f67-11895d18d19a"
    },
    {
      "type": "hysteria",
      "tag": "🇯🇵 10日本(新协议)-全网优化",
      "server": "10jp.prometheusnet01.xyz",
      "server_port": 4430,
      "up_mbps": 80,
      "down_mbps": 150,
      "auth_str": "8e431636-d42f-470f-9f67-11895d18d19a",
      "disable_mtu_discovery": true,
      "tls": {
        "alpn": [
          "h3"
        ],
        "enabled": true,
        "disable_sni": true,
        "insecure": true,
        "server_name": "10jp.prometheusnet01.xyz"
      }
    },
    {
      "type": "shadowsocks",
      "tag": "🇯🇵 10日本-专线(iOS优化)",
      "server": "dnsmart.dg-cdn.mob.networklinkpro.com",
      "server_port": 17882,
      "method": "chacha20-ietf-poly1305",
      "password": "8e431636-d42f-470f-9f67-11895d18d19a"
    },
    {
      "type": "hysteria",
      "tag": "🇺🇸 11美国-全网优化(新协议)",
      "server": "11us.prometheusnet01.xyz",
      "server_port": 4430,
      "up_mbps": 80,
      "down_mbps": 150,
      "auth_str": "8e431636-d42f-470f-9f67-11895d18d19a",
      "disable_mtu_discovery": true,
      "tls": {
        "alpn": [
          "h3"
        ],
        "enabled": true,
        "disable_sni": true,
        "insecure": true,
        "server_name": "11us.prometheusnet01.xyz"
      }
    },
    {
      "type": "shadowsocks",
      "tag": "🇺🇸 11美国-全网优化(iOS优化)",
      "server": "dnsmart.dg-cdn.mob.networklinkpro.com",
      "server_port": 17884,
      "method": "chacha20-ietf-poly1305",
      "password": "8e431636-d42f-470f-9f67-11895d18d19a"
    },
    {
      "type": "hysteria",
      "tag": "🇺🇸 12美国凤凰城-ChatGPT(新协议)",
      "server": "12us.prometheusnet01.xyz",
      "server_port": 4430,
      "up_mbps": 80,
      "down_mbps": 150,
      "auth_str": "8e431636-d42f-470f-9f67-11895d18d19a",
      "disable_mtu_discovery": true,
      "tls": {
        "alpn": [
          "h3"
        ],
        "enabled": true,
        "disable_sni": true,
        "insecure": true,
        "server_name": "12us.prometheusnet01.xyz"
      }
    },
    {
      "type": "vmess",
      "tag": "🇺🇸 12美国凤凰城-ChatGPT(vmess)",
      "server": "12us.prometheusnet01.xyz",
      "server_port": 17848,
      "uuid": "8e431636-d42f-470f-9f67-11895d18d19a",
      "network": "tcp",
      "alter_id": 0,
      "tls": {
        "enabled": true,
        "insecure": false
      }
    },
    {
      "type": "hysteria",
      "tag": "🇦🇪 13迪拜-电信/移动/南方联通(新协议)",
      "server": "13dxb.prometheusnet01.xyz",
      "server_port": 4430,
      "up_mbps": 80,
      "down_mbps": 150,
      "auth_str": "8e431636-d42f-470f-9f67-11895d18d19a",
      "disable_mtu_discovery": true,
      "tls": {
        "alpn": [
          "h3"
        ],
        "enabled": true,
        "disable_sni": true,
        "insecure": true,
        "server_name": "13dxb.prometheusnet01.xyz"
      }
    },
    {
      "type": "hysteria",
      "tag": "🇮🇳 14印度-移动/南方联通(新协议)",
      "server": "14in.prometheusnet01.xyz",
      "server_port": 4430,
      "up_mbps": 80,
      "down_mbps": 150,
      "auth_str": "8e431636-d42f-470f-9f67-11895d18d19a",
      "disable_mtu_discovery": true,
      "tls": {
        "alpn": [
          "h3"
        ],
        "enabled": true,
        "disable_sni": true,
        "insecure": true,
        "server_name": "14in.prometheusnet01.xyz"
      }
    },
    {
      "type": "hysteria",
      "tag": "🇸🇬 15新加坡-全网优化(新协议)",
      "server": "15sg.prometheusnet01.xyz",
      "server_port": 4430,
      "up_mbps": 80,
      "down_mbps": 150,
      "auth_str": "8e431636-d42f-470f-9f67-11895d18d19a",
      "disable_mtu_discovery": true,
      "tls": {
        "alpn": [
          "h3"
        ],
        "enabled": true,
        "disable_sni": true,
        "insecure": true,
        "server_name": "15sg.prometheusnet01.xyz"
      }
    },
    {
      "type": "shadowsocks",
      "tag": "🇸🇬 15新加坡-专线(iOS优化)",
      "server": "dnsmart.dg-cdn.mob.networklinkpro.com",
      "server_port": 17883,
      "method": "chacha20-ietf-poly1305",
      "password": "8e431636-d42f-470f-9f67-11895d18d19a"
    },
    {
      "type": "hysteria",
      "tag": "🇸🇬 24新加坡-联通/移动(新协议)",
      "server": "24sg.prometheusnet01.xyz",
      "server_port": 4430,
      "up_mbps": 80,
      "down_mbps": 150,
      "auth_str": "8e431636-d42f-470f-9f67-11895d18d19a",
      "disable_mtu_discovery": true,
      "tls": {
        "alpn": [
          "h3"
        ],
        "enabled": true,
        "disable_sni": true,
        "insecure": true,
        "server_name": "24sg.prometheusnet01.xyz"
      }
    },
    {
      "type": "hysteria",
      "tag": "🇩🇪 16德国-电信/联通(新协议)",
      "server": "16de.prometheusnet01.xyz",
      "server_port": 4430,
      "up_mbps": 80,
      "down_mbps": 150,
      "auth_str": "8e431636-d42f-470f-9f67-11895d18d19a",
      "disable_mtu_discovery": true,
      "tls": {
        "alpn": [
          "h3"
        ],
        "enabled": true,
        "disable_sni": true,
        "insecure": true,
        "server_name": "16de.prometheusnet01.xyz"
      }
    },
    {
      "type": "hysteria",
      "tag": "🇬🇧 17英国-ChatGPT(新协议)",
      "server": "17uk.prometheusnet01.xyz",
      "server_port": 4430,
      "up_mbps": 80,
      "down_mbps": 150,
      "auth_str": "8e431636-d42f-470f-9f67-11895d18d19a",
      "disable_mtu_discovery": true,
      "tls": {
        "alpn": [
          "h3"
        ],
        "enabled": true,
        "disable_sni": true,
        "insecure": true,
        "server_name": "17uk.prometheusnet01.xyz"
      }
    },
    {
      "type": "hysteria",
      "tag": "🇨🇦 18加拿大-ChatGPT(新协议)",
      "server": "18ca.prometheusnet01.xyz",
      "server_port": 4430,
      "up_mbps": 80,
      "down_mbps": 150,
      "auth_str": "8e431636-d42f-470f-9f67-11895d18d19a",
      "disable_mtu_discovery": true,
      "tls": {
        "alpn": [
          "h3"
        ],
        "enabled": true,
        "disable_sni": true,
        "insecure": true,
        "server_name": "18ca.prometheusnet01.xyz"
      }
    },
    {
      "type": "hysteria",
      "tag": "🇦🇺 19悉尼-ChatGPT(新协议)",
      "server": "19sdy.prometheusnet01.xyz",
      "server_port": 4430,
      "up_mbps": 80,
      "down_mbps": 150,
      "auth_str": "8e431636-d42f-470f-9f67-11895d18d19a",
      "disable_mtu_discovery": true,
      "tls": {
        "alpn": [
          "h3"
        ],
        "enabled": true,
        "disable_sni": true,
        "insecure": true,
        "server_name": "19sdy.prometheusnet01.xyz"
      }
    },
    {
      "type": "hysteria",
      "tag": "🇧🇷 20巴西-ChatGPT(新协议)",
      "server": "20br.prometheusnet01.xyz",
      "server_port": 4430,
      "up_mbps": 80,
      "down_mbps": 150,
      "auth_str": "8e431636-d42f-470f-9f67-11895d18d19a",
      "disable_mtu_discovery": true,
      "tls": {
        "alpn": [
          "h3"
        ],
        "enabled": true,
        "disable_sni": true,
        "insecure": true,
        "server_name": "20br.prometheusnet01.xyz"
      }
    },
    {
      "type": "hysteria",
      "tag": "🇨🇱 21智利-ChatGPT(新协议)",
      "server": "21chi.prometheusnet01.xyz",
      "server_port": 4430,
      "up_mbps": 80,
      "down_mbps": 150,
      "auth_str": "8e431636-d42f-470f-9f67-11895d18d19a",
      "disable_mtu_discovery": true,
      "tls": {
        "alpn": [
          "h3"
        ],
        "enabled": true,
        "disable_sni": true,
        "insecure": true,
        "server_name": "21chi.prometheusnet01.xyz"
      }
    },
    {
      "type": "hysteria",
      "tag": "🇹🇷 22土耳其-电信/联通(新协议)",
      "server": "22tr.prometheusnet01.xyz",
      "server_port": 4433,
      "up_mbps": 80,
      "down_mbps": 150,
      "auth_str": "8e431636-d42f-470f-9f67-11895d18d19a",
      "disable_mtu_discovery": true,
      "tls": {
        "alpn": [
          "h3"
        ],
        "enabled": true,
        "disable_sni": true,
        "insecure": true,
        "server_name": "22tr.prometheusnet01.xyz"
      }
    },
    {
      "type": "hysteria",
      "tag": "🇫🇷 23法国-全网优化(新协议)",
      "server": "23fr.prometheusnet01.xyz",
      "server_port": 4430,
      "up_mbps": 80,
      "down_mbps": 150,
      "auth_str": "8e431636-d42f-470f-9f67-11895d18d19a",
      "disable_mtu_discovery": true,
      "tls": {
        "alpn": [
          "h3"
        ],
        "enabled": true,
        "disable_sni": true,
        "insecure": true,
        "server_name": "23fr.prometheusnet01.xyz"
      }
    },
    {
      "tag": "🇭🇰 HK WSS",
      "type": "vmess",
      "server": "hk.yicanny.com",
      "server_port": 2096,
      "uuid": "d18d8d88-5e16-11ec-81f5-42010aaa000c",
      "security": "auto",
      "alter_Id": 0,
      "packet_encoding": "xudp",
      "tls": {
        "enabled": true,
        "insecure": true,
        "server_name": "hk.yicanny.com"
      },
      "transport": {
        "type": "ws",
        "path": "/oC13d0PS/",
        "headers": {
          "Host": "hk.yicanny.com"
        }
      }
    },
    {
      "tag": "🇹🇼 TW wss",
      "type": "vmess",
      "server": "tw1.yicanny.com",
      "server_port": 2096,
      "uuid": "38782c08-596a-11ec-a844-42010a8c0022",
      "security": "auto",
      "alter_Id": 0,
      "packet_encoding": "xudp",
      "tls": {
        "enabled": true,
        "insecure": true,
        "server_name": "tw1.yicanny.com"
      },
      "transport": {
        "type": "ws",
        "path": "/FTtV9jIR/",
        "headers": {
          "Host": "tw1.yicanny.com"
        }
      }
    },
    {
      "tag": "🇹🇼 TW tr",
      "type": "trojan",
      "server": "tw1.yicanny.com",
      "server_port": 443,
      "password": "jim19830816",
      "tls": {
        "enabled": true,
        "insecure": true,
        "utls": {
          "enabled": true,
          "fingerprint": "chrome"
        }
      }
    },
    {
      "tag": "🇹🇼 TW 1tr",
      "type": "trojan",
      "server": "tw2.yicanny.com",
      "server_port": 443,
      "password": "jim19830816",
      "tls": {
        "enabled": true,
        "insecure": true,
        "utls": {
          "enabled": true,
          "fingerprint": "chrome"
        }
      }
    },
    {
      "tag": "hk re",
      "type": "vless",
      "server": "34.92.1.204",
      "server_port": 47777,
      "uuid": "94595a95-c706-4cb6-bf8c-c040ffed7f14",
      "packet_encoding": "xudp",
      "flow": "xtls-rprx-vision",
      "tls": {
        "enabled": true,
        "server_name": "addons.mozilla.org",
        "utls": {
          "enabled": true,
          "fingerprint": "chrome"
        },
        "reality": {
          "enabled": true,
          "public_key": "S-g0oP36DShii1uPOnZDSEhp_wQghX6h68PgMivOmD4",
          "short_id": ""
        }
      }
    },
    {
      "tag": "🇺🇸 US tr",
      "type": "trojan",
      "server": "us.yicanny.com",
      "server_port": 443,
      "password": "jim19830816",
      "tls": {
        "enabled": true,
        "insecure": true,
        "utls": {
          "enabled": true,
          "fingerprint": "chrome"
        }
      }
    },
    {
      "tag": "🇬🇧 UK",
      "type": "vmess",
      "server": "uk.yicanny.com",
      "server_port": 2096,
      "uuid": "0c21d0b3-e144-11eb-ac14-42010a9a0002",
      "security": "auto",
      "alter_Id": 0,
      "packet_encoding": "xudp",
      "tls": {
        "enabled": true,
        "insecure": true,
        "server_name": "uk.yicanny.com"
      },
      "transport": {
        "type": "ws",
        "path": "/v8HnqNwA/",
        "headers": {
          "Host": "uk.yicanny.com"
        }
      }
    },
    {
      "tag": "🇬🇪 GE wss",
      "type": "vmess",
      "server": "de.yicanny.com",
      "server_port": 2096,
      "uuid": "a14bf39f-eddc-11eb-8b61-42010a9c0002",
      "security": "auto",
      "alter_Id": 0,
      "packet_encoding": "xudp",
      "tls": {
        "enabled": true,
        "insecure": true,
        "server_name": "de.yicanny.com"
      },
      "transport": {
        "type": "ws",
        "path": "/xihayWM5/",
        "headers": {
          "Host": "de.yicanny.com"
        }
      }
    },
    {
      "tag": "tw h22",
      "type": "vmess",
      "server": "tw1.yicanny.com",
      "server_port": 2053,
      "uuid": "3ff1a03a-5966-11ec-a844-42010a8c0022",
      "security": "auto",
      "alter_Id": 0,
      "packet_encoding": "xudp",
      "tls": {
        "enabled": true,
        "insecure": true,
        "server_name": ""
      }
    },
    {
      "tag": "🇭🇰 HK vmg",
      "type": "vmess",
      "server": "hk.yicanny.com",
      "server_port": 2053,
      "uuid": "52da20de-76bf-11ec-81f5-42010aaa000c",
      "security": "auto",
      "alter_Id": 0,
      "packet_encoding": "xudp",
      "tls": {
        "enabled": true,
        "insecure": true,
        "server_name": ""
      },
      "transport": {
        "type": "grpc",
        "service_name": "fvV7cXyt"
      }
    },
    {
      "tag": "tw vlt",
      "type": "vless",
      "server": "tw1.yicanny.com",
      "server_port": 2083,
      "uuid": "7ba5d06f-596c-11ec-a844-42010a8c0022",
      "packet_encoding": "xudp",
      "tls": {
        "enabled": true,
        "server_name": "tw1.yicanny.com",
        "utls": {
          "enabled": true,
          "fingerprint": "chrome"
        }
      }
    },
    {
      "tag": "🇺🇸 US vmg",
      "type": "vmess",
      "server": "us.yicanny.com",
      "server_port": 2053,
      "uuid": "65d8b398-79e5-11ec-9405-42010aa80002",
      "security": "auto",
      "alter_Id": 0,
      "packet_encoding": "xudp",
      "tls": {
        "enabled": true,
        "insecure": true,
        "server_name": ""
      },
      "transport": {
        "type": "grpc",
        "service_name": "tojQZyeJ"
      }
    },
    {
      "tag": "🇬🇪 GE vmg",
      "type": "vmess",
      "server": "de.yicanny.com",
      "server_port": 2053,
      "uuid": "c8de82e2-79e0-11ec-8b61-42010a9c0002",
      "security": "auto",
      "alter_Id": 0,
      "packet_encoding": "xudp",
      "tls": {
        "enabled": true,
        "insecure": true,
        "server_name": ""
      },
      "transport": {
        "type": "grpc",
        "service_name": "FybIGjkD"
      }
    },
    {
      "tag": "🇬🇧 UK vmg",
      "type": "vmess",
      "server": "uk.yicanny.com",
      "server_port": 2053,
      "uuid": "4ce0300e-79e1-11ec-ac14-42010a9a0002",
      "security": "auto",
      "alter_Id": 0,
      "packet_encoding": "xudp",
      "tls": {
        "enabled": true,
        "insecure": true,
        "server_name": ""
      },
      "transport": {
        "type": "grpc",
        "service_name": "nftUML5p"
      }
    },
    {
      "tag": "🇭🇰 HK 1WSS",
      "type": "vmess",
      "server": "hk2.yicanny.com",
      "server_port": 2096,
      "uuid": "bed92880-aaa8-46fb-b906-0f9b939aa220",
      "security": "auto",
      "alter_Id": 0,
      "packet_encoding": "xudp",
      "tls": {
        "enabled": true,
        "insecure": true,
        "server_name": "hk2.yicanny.com"
      },
      "transport": {
        "type": "ws",
        "path": "/cU3oEG2d/",
        "headers": {
          "Host": "hk2.yicanny.com"
        }
      }
    },
    {
      "tag": "🇹🇼 TW 1WSS",
      "type": "vmess",
      "server": "tw2.yicanny.com",
      "server_port": 2096,
      "uuid": "467cbf8c-9bfc-4618-b06f-4d798660566c",
      "security": "auto",
      "alter_Id": 0,
      "packet_encoding": "xudp",
      "tls": {
        "enabled": true,
        "insecure": true,
        "server_name": "tw2.yicanny.com"
      },
      "transport": {
        "type": "ws",
        "path": "/plbLV1A4/",
        "headers": {
          "Host": "tw2.yicanny.com"
        }
      }
    },
    {
      "tag": "🇺🇸 US WSS",
      "type": "vmess",
      "server": "us.yicanny.com",
      "server_port": 2096,
      "uuid": "4fb085aa-b043-4b0c-9e64-f44fe1646f72",
      "security": "auto",
      "alter_Id": 0,
      "packet_encoding": "xudp",
      "tls": {
        "enabled": true,
        "insecure": true,
        "server_name": "us.yicanny.com"
      },
      "transport": {
        "type": "ws",
        "path": "/M0nmS6Pr/",
        "headers": {
          "Host": "us.yicanny.com"
        }
      }
    },
    {
      "tag": "🇭🇰 HK 1TR",
      "type": "trojan",
      "server": "hk2.yicanny.com",
      "server_port": 443,
      "password": "jim19830816",
      "tls": {
        "enabled": true,
        "insecure": true,
        "utls": {
          "enabled": true,
          "fingerprint": "chrome"
        }
      }
    },
    {
      "tag": "tw vmg",
      "type": "vmess",
      "server": "tw1.yicanny.com",
      "server_port": 2085,
      "uuid": "9bd1fb1e-4eda-11ee-a21a-42010a8c0022",
      "security": "auto",
      "alter_Id": 0,
      "packet_encoding": "xudp",
      "tls": {
        "enabled": true,
        "insecure": true,
        "server_name": ""
      },
      "transport": {
        "type": "grpc",
        "service_name": "9XAFCdSo"
      }
    },
    {
      "tag": "tw ws",
      "type": "vmess",
      "server": "104.155.212.127",
      "server_port": 2086,
      "uuid": "5a81b410-4eda-11ee-a21a-42010a8c0022",
      "security": "auto",
      "alter_Id": 0,
      "packet_encoding": "xudp",
      "transport": {
        "type": "ws",
        "path": "/frYNIcDU/",
        "headers": {
          "Host": ""
        }
      }
    },
    {
      "tag": "tw vlg",
      "type": "vless",
      "server": "tw1.yicanny.com",
      "server_port": 2087,
      "uuid": "bde4de30-c69d-4ecc-872c-4a5fd9fa7735",
      "packet_encoding": "xudp",
      "tls": {
        "enabled": true,
        "server_name": "None",
        "utls": {
          "enabled": true,
          "fingerprint": "chrome"
        }
      },
      "transport": {
        "type": "grpc",
        "service_name": "xfQsj2Y3"
      }
    },
    {
      "tag": "tw re",
      "type": "vless",
      "server": "104.155.212.127",
      "server_port": 2089,
      "uuid": "10df929e-8884-402d-8690-d44bcbd57a02",
      "packet_encoding": "xudp",
      "flow": "xtls-rprx-vision",
      "tls": {
        "enabled": true,
        "server_name": "addons.mozilla.org",
        "utls": {
          "enabled": true,
          "fingerprint": "chrome"
        },
        "reality": {
          "enabled": true,
          "public_key": "1TAtu7iADEwvN3IJ-8jUuNPw9yPWcYj7MenX8vGYzy0",
          "short_id": "25c3b460edf719a8"
        }
      }
    },
    {
      "tag": "tw1 re",
      "type": "vless",
      "server": "34.80.63.170",
      "server_port": 47777,
      "uuid": "93b487d4-a880-4868-831a-70c21ac581df",
      "packet_encoding": "xudp",
      "flow": "xtls-rprx-vision",
      "tls": {
        "enabled": true,
        "server_name": "addons.mozilla.org",
        "utls": {
          "enabled": true,
          "fingerprint": "chrome"
        },
        "reality": {
          "enabled": true,
          "public_key": "9SYVvmG7n9yRYlNZFDxbpQ4jSkC_RgtPEpHBdlHN0y0",
          "short_id": "94b61ca3085e7fd2"
        }
      }
    },
    {
      "tag": "CC1-01",
      "type": "vmess",
      "server": "4.1808.cf",
      "server_port": 30001,
      "uuid": "9383837d-dfba-47c8-9735-2b453230bfcd",
      "security": "auto",
      "alter_Id": 0,
      "packet_encoding": "xudp",
      "tls": {
        "enabled": true,
        "insecure": true,
        "server_name": "20230518cc.1808.cf"
      },
      "transport": {
        "type": "ws",
        "path": "9383837d",
        "headers": {
          "Host": "20230518cc.1808.cf"
        }
      }
    },
    {
      "tag": "CC1-02",
      "type": "vmess",
      "server": "5.1808.cf",
      "server_port": 30001,
      "uuid": "9383837d-dfba-47c8-9735-2b453230bfcd",
      "security": "auto",
      "alter_Id": 0,
      "packet_encoding": "xudp",
      "tls": {
        "enabled": true,
        "insecure": true,
        "server_name": "20230518cc.1808.cf"
      },
      "transport": {
        "type": "ws",
        "path": "9383837d",
        "headers": {
          "Host": "20230518cc.1808.cf"
        }
      }
    },
    {
      "tag": "CC1-03",
      "type": "vmess",
      "server": "6.1808.cf",
      "server_port": 30001,
      "uuid": "9383837d-dfba-47c8-9735-2b453230bfcd",
      "security": "auto",
      "alter_Id": 0,
      "packet_encoding": "xudp",
      "tls": {
        "enabled": true,
        "insecure": true,
        "server_name": "20230518cc.1808.cf"
      },
      "transport": {
        "type": "ws",
        "path": "9383837d",
        "headers": {
          "Host": "20230518cc.1808.cf"
        }
      }
    },
    {
      "tag": "CC2-server ws1",
      "type": "vmess",
      "server": "www.who.int",
      "server_port": 80,
      "uuid": "52736503-49aa-4704-ada2-d7059a9f697e",
      "security": "auto",
      "alter_Id": 0,
      "packet_encoding": "xudp",
      "transport": {
        "type": "ws",
        "path": "/52736503-49aa-4704-ada2-d7059a9f697e-vmess",
        "headers": {
          "Host": "cc2.1808.cf"
        }
      }
    },
    {
      "tag": "CC2-server ws2",
      "type": "vmess",
      "server": "v4.1808.cf",
      "server_port": 80,
      "uuid": "52736503-49aa-4704-ada2-d7059a9f697e",
      "security": "auto",
      "alter_Id": 0,
      "packet_encoding": "xudp",
      "transport": {
        "type": "ws",
        "path": "/52736503-49aa-4704-ada2-d7059a9f697e-vmess",
        "headers": {
          "Host": "cc2.1808.cf"
        }
      }
    },
    {
      "tag": "🇺🇸 US-WS1-1",
      "type": "vmess",
      "server": "www.who.int",
      "server_port": 80,
      "uuid": "9383837d-dfba-47c8-9735-2b453230bfcd",
      "security": "auto",
      "alter_Id": 0,
      "packet_encoding": "xudp",
      "transport": {
        "type": "ws",
        "path": "9383837d",
        "headers": {
          "Host": "20230518cc.1808.cf"
        }
      }
    },
    {
      "tag": "🇺🇸 US-WS1-2",
      "type": "vmess",
      "server": "v4.1808.cf",
      "server_port": 80,
      "uuid": "9383837d-dfba-47c8-9735-2b453230bfcd",
      "security": "auto",
      "alter_Id": 0,
      "packet_encoding": "xudp",
      "transport": {
        "type": "ws",
        "path": "9383837d",
        "headers": {
          "Host": "20230518cc.1808.cf"
        }
      }
    }
  ],
  "route": {
    "auto_detect_interface": true,
    "final": "proxy",
    "geoip": {
      "download_url": "https://github.com/SagerNet/sing-geoip/releases/latest/download/geoip.db",
      "download_detour": "🌌 Google"
    },
    "geosite": {
      "download_url": "https://github.com/soffchen/sing-geosite/releases/latest/download/geosite.db",
      "download_detour": "🌌 Google"
    },
    "rules": [
      {
        "protocol": "dns",
        "outbound": "dns-out"
      },
      {
        "network": "udp",
        "port": 443,
        "outbound": "block"
      },
      {
        "geosite": "category-ads-all",
        "outbound": "block"
      },
      {
        "clash_mode": "direct",
        "outbound": "direct"
      },
      {
        "clash_mode": "global",
        "outbound": "proxy"
      },
      {
        "domain": [
          "clash.razord.top",
          "yacd.metacubex.one",
          "yacd.haishan.me",
          "d.metacubex.one"
        ],
        "outbound": "direct"
      },
      {
        "domain_keyword": "himalaya",
        "outbound": "🤖 hi"
      },
      {
        "domain_keyword": "gnews",
        "outbound": "🤖 gn"
      },
      {
        "domain_keyword": "gettr",
        "outbound": "🤖 gr"
      },
      {
        "package_name": [
          "org.telegram.plus"
        ],
        "outbound": "📟 Telegram"
      },
      {
        "package_name": [
          "org.telegram.messenger.web"
        ],
        "outbound": "📟 Telegram"
      },
      {
        "package_name": [
          "app.revanced.android.apps.youtube.music"
        ],
        "outbound": "🌌 ytm"
      },
      {
        "package_name": [
          "app.google.android.apps.youtube.music"
        ],
        "outbound": "🌌 ytm"
      },
      {
        "package_name": [
          "com.whatsapp"
        ],
        "outbound": "🐦 Twitter"
      },
      {
        "package_name": [
          "com.discord"
        ],
        "outbound": "🐦 Twitter"
      },
      {
        "geosite": "openai",
        "outbound": "🤖 OpenAI"
      },
      {
        "geosite": "youtube",
        "outbound": "🌌 yt"
      },
      {
        "geoip": "google",
        "geosite": [
          "google",
          "github"
        ],
        "outbound": "🌌 Google"
      },
      {
        "geoip": "telegram",
        "geosite": "telegram",
        "outbound": "📟 Telegram"
      },
      {
        "geoip": "twitter",
        "geosite": "twitter",
        "outbound": "🐦 Twitter"
      },
      {
        "geoip": "facebook",
        "geosite": [
          "facebook",
          "instagram"
        ],
        "outbound": "🐦 Twitter"
      },
      {
        "geosite": "amazon",
        "outbound": "🛍️ Amazon"
      },
      {
        "geosite": "apple",
        "outbound": "🍎 Apple"
      },
      {
        "geosite": "microsoft",
        "outbound": "🧩 Microsoft"
      },
      {
        "geosite": "category-games",
        "outbound": "🎮 Game"
      },
      {
        "geosite": "bilibili",
        "outbound": "📺 Bilibili"
      },
      {
        "geoip": "netflix",
        "geosite": [
          "tiktok",
          "netflix",
          "hbo",
          "disney",
          "primevideo"
        ],
        "outbound": "🎬 MediaVideo"
      },
      {
        "geosite": "gfw",
        "outbound": "🌏 final"
      },
      {
        "geosite": "geolocation-!cn",
        "outbound": "🌏 !cn"
      },
      {
        "geosite": [
          "private",
          "geolocation-cn"
        ],
        "geoip": [
          "private",
          "cn"
        ],
        "outbound": "direct"
      }
    ]
  },
  "experimental": {
    "clash_api": {
      "external_controller": "127.0.0.1:9090",
      "external_ui_download_url": "",
      "external_ui_download_detour": "",
      "external_ui": "ui",
      "secret": "",
      "default_mode": "rule",
      "store_selected": true,
      "cache_file": "",
      "cache_id": ""
    }
  }
}
